mahendrakumarshinde/MyRepo/1. IDE_PLUS Firmwares/wifi_station_ESP32/Conductor.cpp
#include "Conductor.h"
#include "Utilities.h"
// #include <ArduinoTrace.h>
#include <base64.h>
#include <ESP32Ping.h>

#define UART_TX_FIFO_SIZE 0x80
#define OTA_PACKET_SIZE 1024
/* =============================================================================
    Instanciation
============================================================================= */

char hostSerialBuffer[16427];

IUSerial hostSerial(&Serial, hostSerialBuffer, 16427, IUSerial::MS_PROTOCOL,
                    115200, ';', 1000);

IURawDataHelper accelRawDataHelper(10000,  // 10s timeout to input all keys
                                   300000,  // 5min timeout to succefully post data
                                   DATA_DEFAULT_ENDPOINT_HOST,
                                   RAW_DATA_DEFAULT_ENDPOINT_ROUTE,
                                   DATA_DEFAULT_ENDPOINT_PORT);

IUMQTTHelper mqttHelper = IUMQTTHelper();

IUTimeHelper timeHelper(2390, "time.google.com");

IUESPFlash iuWiFiFlash = IUESPFlash();

const char* CERT_TYPES[6] = { "EAP-TLS-CERT",
                              "EAP-TLS-KEY",
                              "MQTT-TLS-CERT",
                              "MQTT-TLS-KEY",
                              "SSL",
                              "OEM-SSL"};
/* =============================================================================
    Conductor
============================================================================= */

Conductor::Conductor() :
    m_useMQTT(true),
    m_lastMQTTInfoRequest(0),
    m_lastConnectionAttempt(0),
    m_disconnectionTimerStart(0),
    m_disconnectionMqttTimerStart(0),
    m_lastWifiStatusUpdate(0),
    m_lastWifiStatusCheck(0),
    m_lastWifiInfoPublication(0),
    m_mqttServerIP()
{
    m_featurePostPort = DATA_DEFAULT_ENDPOINT_PORT;
    m_diagnosticPostPort = DATA_DEFAULT_ENDPOINT_PORT;
    m_credentialValidator.setTimeout(wifiConfigReceptionTimeout);
    m_staticConfigValidator.setTimeout(wifiConfigReceptionTimeout);
    m_mqttServerValidator.setTimeout(wifiConfigReceptionTimeout);
    m_mqttCredentialsValidator.setTimeout(wifiConfigReceptionTimeout);
    m_wifiMAC.fromString(WiFi.macAddress().c_str());
    // Default values for endpoints
    strncpy(m_featurePostHost, DATA_DEFAULT_ENDPOINT_HOST, MAX_HOST_LENGTH);
    strncpy(m_featurePostRoute, FEATURE_DEFAULT_ENDPOINT_ROUTE,
            MAX_ROUTE_LENGTH);
    strncpy(m_diagnosticPostHost, DATA_DEFAULT_ENDPOINT_HOST, MAX_HOST_LENGTH);
    strncpy(m_diagnosticPostRoute, DIAGNOSTIC_DEFAULT_ENDPOINT_ROUTE,
            MAX_ROUTE_LENGTH);
}

void Conductor::setBleMAC(MacAddress hostBLEMac)
{
    m_bleMAC = hostBLEMac;
    mqttHelper.setDeviceMAC(m_bleMAC);
}

void Conductor::setBleMAC(const char *hostBLEMac)
{
    m_bleMAC.fromString(hostBLEMac);
    mqttHelper.setDeviceMAC(m_bleMAC);
}

/**
 *
 *
 * @param duration_ms The sleep duration in microseconds. If duration_ms=0, will
 *  sleep for default Conductor::deepSleepDuration.
 */
void Conductor::deepsleep(uint32_t duration_ms)
{
    if (debugMode)
    {
        debugPrint("Going to deep-sleep");
    }
    hostSerial.sendMSPCommand(MSPCommand::WIFI_ALERT_DISCONNECTED);
    hostSerial.sendMSPCommand(MSPCommand::WIFI_ALERT_SLEEPING);
    delay(100); // Wait for serial messages to be sent
    ESP.deepSleep(duration_ms * 1000);
}


/* =============================================================================
    Communication with host
============================================================================= */

/**
 *
 */
void Conductor::processHostMessage(IUSerial *iuSerial)
{   
    MSPCommand::command cmd = iuSerial->getMspCommand();
    char *buffer = iuSerial->getBuffer();
    uint16_t bufferLength = iuSerial->getCurrentBufferLength();
    char resp[2] = "";
    resp[1] = 0;
    char message[256];
    switch(cmd) {
        case MSPCommand::OTA_INIT_ACK:
            if(otaInProgress == true) {
                mqttHelper.publish(OTA_TOPIC,buffer);
            }
            otaInitTimeoutFlag = false;
            break;
        case MSPCommand::OTA_FDW_START:
            if(otaInProgress == true) {    
                mqttHelper.publish(OTA_TOPIC,buffer);
                strncpy(ota_uri, otaStm_uri, 512);
                delay(100);
                otaDnldFw(false); //false => Start of FW Dnld
            }
            otaInitTimeoutFlag = false;
            break;
        case MSPCommand::OTA_FDW_ABORT:
            mqttHelper.publish(OTA_TOPIC,buffer);
            http_ota.end();
            otaInProgress = false;
            waitingForPktAck = false;
            otaInitTimeoutFlag = false;
            break;
        case MSPCommand::OTA_FUG_START:
            mqttHelper.publish(OTA_TOPIC,buffer);
            otaInitTimeoutFlag = false;
            break;
        case MSPCommand::OTA_FUG_SUCCESS:
            mqttHelper.publish(OTA_TOPIC,buffer);
            otaInProgress = false;
            waitingForPktAck = false;
            otaInitTimeoutFlag = false;
            delay(100);
            break;
        case MSPCommand::OTA_FUG_ABORT:
            mqttHelper.publish(OTA_TOPIC,buffer);
            otaInProgress = false;
            waitingForPktAck = false;
            otaInitTimeoutFlag = false;
            delay(100);
            break;
        case MSPCommand::OTA_PACKET_ACK:
            waitingForPktAck = false;
            otaInitTimeoutFlag = false;
            otaDnldFw(true);   //true => Cont. of FW Dnld
            break;
        case MSPCommand::OTA_STM_DNLD_OK:
            strncpy(ota_uri, otaEsp_uri, 512);
            otaDnldFw(false); //false => Start of FW Dnld
            break;
        case MSPCommand::OTA_ESP_DNLD_OK:
            break;
        case MSPCommand::OTA_FDW_SUCCESS:
            mqttHelper.publish(OTA_TOPIC,buffer);
//            otaInProgress = false; // Temp. Only after Download+Upgrade+Validation this shall be set to false
            waitingForPktAck = false;
            otaInitTimeoutFlag = false;
            break;
        case MSPCommand::SET_OTA_STM_URI:
            strcpy(otaStm_uri,buffer);
            delay(1);
            break;
        case MSPCommand::SET_OTA_ESP_URI:
            strcpy(otaEsp_uri,buffer);
            delay(1);
            break;
        case MSPCommand::SET_TLS_CERT_URI:
            strcpy(otaStm_uri,buffer);      // using the ota buffer for cert uri 
            delay(1);
            break;
        case MSPCommand::SET_TLS_KEY_URI:
            strcpy(otaEsp_uri,buffer);
            delay(1);
            break;
        case MSPCommand::TLS_INIT_ACK:
            {
                // if(otaInProgress == true) {
                //     mqttHelper.publish(OTA_TOPIC,buffer);
                // }
                // otaInitTimeoutFlag = false;
                // memset(client_cert,0x00,2048);
                // memset(client_key,0x00,2048);
                // bool certDownloadDone = false;
                // bool keyDownloadDone = false;
                //certDownloadDone = getDeviceCertificates(otaStm_uri,"/tls/client.crt");           
                // delay(1);
                // keyDownloadDone = getDeviceCertificates(otaEsp_uri,"/tls/client.key");
                // delay(1);
                
                // readCertificatesFromFlash(SPIFFS,"/tls/client.crt");
                // //delay(1);
                // //readCertificatesFromFlash(SPIFFS,"/tls/client.key");
                // delay(1);
                // Serial.println("CERT Reading completed....");
                
                // hostSerial.sendLongMSPCommand(MSPCommand::ESP_DEBUG_TO_STM_HOST,3000000,client_cert,sizeof(client_cert));
                // delay(10);
                // hostSerial.sendLongMSPCommand(MSPCommand::ESP_DEBUG_TO_STM_HOST,3000000,client_key,sizeof(client_key));
                // delay(10);
                // memset(client_cert,0x00,2048);
                // memset(client_key,0x00,2048);
                // ReadBinFile(SPIFFS,"/eapTlsCert.crt");
                // ReadBinFile(SPIFFS,"/eapTlsKey.key");
                // delay(1);
                // hostSerial.sendLongMSPCommand(MSPCommand::ESP_DEBUG_TO_STM_HOST,3000000,client_cert,1200);
                // delay(100);
                // hostSerial.sendLongMSPCommand(MSPCommand::ESP_DEBUG_TO_STM_HOST,3000000,client_key,1700);
                // delay(100);
                break;
            }
        case MSPCommand::SET_DIAGNOSTIC_URL:
            updateDiagnosticEndpoint(buffer,bufferLength);
            break;
        case MSPCommand::SEND_WIFI_CONFIG:
            updateConfig(IUESPFlash::CFG_WIFI, buffer,bufferLength-1);  // Removed extra byte
            setWiFiConfig();
            break;
        case MSPCommand::CERT_DOWNLOAD_INIT_ACK:
            {
                //Serial.print("CERT DOWNLOAD INIT ACK :");Serial.println(buffer);
                publishedDiagnosticMessage(buffer,bufferLength);
                certDownloadInitAck = true;
                downloadInitTimer = false;
                // trigger the config downloading can send the messageID 
                hostSerial.sendMSPCommand(MSPCommand::GET_CERT_DOWNLOAD_CONFIG);
            break;
            }
        case MSPCommand::CERT_UPGRADE_INIT:
            //Serial.print("CERT UPGRADE INIT :");Serial.println(buffer);
            publishedDiagnosticMessage(buffer,bufferLength);          
            break;
            
        case MSPCommand::CERT_UPGRADE_SUCCESS:
            //Serial.print("CERT UPGRADE Success :");Serial.println(buffer);
            //mqttHelper.publish(CERT_STATUS_TOPIC,buffer);
            upgradeReceived = false;
            downloadInitTimer = true;
            publishedDiagnosticMessage(buffer,bufferLength);
            break;
        case MSPCommand::CERT_UPGRADE_ABORT:
            //Serial.print("CERT UPGRADE Failed/ABORTED :");Serial.println(buffer);
            publishedDiagnosticMessage(buffer,bufferLength);
            if(newDownloadConnectonAttempt > maxMqttCertificateDownloadCount){ 
                downloadInitTimer = false;
                upgradeReceived = false;
            }else
            {
               downloadInitTimer = true;
               upgradeReceived = false;
            }
            resetMqttConnectionFlags();
            break;
        case MSPCommand::CERT_DOWNLOAD_ABORT:
            //Serial.print("CERT DOWNLOAD ABORTED :");Serial.println(buffer);
            otaInProgress = false;
            waitingForPktAck = false;
            otaInitTimeoutFlag = false;
            publishedDiagnosticMessage(buffer,bufferLength);
            //delay(10);
            upgradeReceived = false;
            resetMqttConnectionFlags();
            break;
                    
        case MSPCommand::CERT_DOWNLOAD_SUCCESS:
             //Serial.print("CERT DOWNLOAD Success : ");Serial.println(buffer);
             otaInProgress = false;
             waitingForPktAck = false;
             otaInitTimeoutFlag = false;
             resetMqttConnectionFlags();
             publishedDiagnosticMessage(buffer,bufferLength);
             delay(10);
             
             break;
            
        case MSPCommand::CERT_NO_DOWNLOAD_AVAILABLE:
            //Serial.print("NO DOWNLOAD AVAILABLE :");Serial.println(buffer);
            publishedDiagnosticMessage(buffer,bufferLength);
            break;
            
        case MSPCommand::ALL_MQTT_CONNECT_ATTEMPT_FAILED:
            //Serial.print("All Connection Attempt Failed : ");Serial.println(buffer);
            // TODO :Send to Diagnostic endpoint if mqtt not connected
            publishedDiagnosticMessage(buffer,bufferLength);
            break;
        case MSPCommand::CERT_UPGRADE_TRIGGER:
            //Serial.println("RECEIVED THE CERT UPGRADE COMMAND, Init Download process");
            upgradeReceived = true;
            downloadInitTimer = false;
            iuSerial->sendMSPCommand(MSPCommand::CERT_DOWNLOAD_INIT,CERT_DOWNLOAD_DEFAULT_MESSAGEID);
            break;
        case MSPCommand::ASK_WIFI_FV:
            iuSerial->sendMSPCommand(MSPCommand::RECEIVE_WIFI_FV, FIRMWARE_VERSION);
            break;
        case MSPCommand::GOOGLE_TIME_QUERY:
            timeHelper.readGoogletime();
            break;
        case MSPCommand::CONFIG_ACK:
            // Send the fft configuration update acknowledgement to command response topic
            mqttHelper.publish(COMMAND_RESPONSE_TOPIC,buffer);
            break;

        /***** MAC addresses *****/
        case MSPCommand::RECEIVE_BLE_MAC:
            setBleMAC(iuSerial->mspReadMacAddress());
            break;
        case MSPCommand::ASK_WIFI_MAC:
            iuSerial->mspSendMacAddress(MSPCommand::RECEIVE_WIFI_MAC,
                                        m_wifiMAC);
            break;
        case MSPCommand::RECEIVE_HOST_FIRMWARE_VERSION: 
            getDeviceFirmwareVersion(message,buffer,FIRMWARE_VERSION);
            mqttHelper.publishDiagnostic(message);
            strncpy(HOST_FIRMWARE_VERSION, buffer, 8);
            break;
        case MSPCommand::RECEIVE_HOST_SAMPLING_RATE:
            HOST_SAMPLING_RATE = atoi(buffer);
            break;
        case MSPCommand::RECEIVE_HOST_BLOCK_SIZE:
            HOST_BLOCK_SIZE = atoi(buffer);
            break;
        case MSPCommand::GET_DEVICE_CONFIG: 
             if(strlen(buffer)>0){
                char *str;
                int i=0;
                while((str = strtok_r(buffer,"-",&buffer)) != NULL)
                {
                    if(i==0)
                    {
                        strcpy(HOST_FIRMWARE_VERSION,str);
                        i++;
                    }else if(i == 1){
                        HOST_SAMPLING_RATE=atoi(str);
                        i++;
                    }else if(i == 2){
                        HOST_BLOCK_SIZE=atoi(str);
                        i++;
                    }
                
