mahendrakumarshinde/MyRepo/1. IDE_PLUS Firmwares/wifi_station_ESP32/Conductor.cpp
        /***** Settable parameters (addresses, credentials, etc) *****/
        case MSPCommand::SET_RAW_DATA_ENDPOINT_HOST:
            accelRawDataHelper.setEndpointHost(buffer);
            //mqttHelper.publish(FINGERPRINT_DATA_PUBLISH_TOPIC, "RAW HOST...");
            break;
        case MSPCommand::SET_RAW_DATA_ENDPOINT_ROUTE:
            accelRawDataHelper.setEndpointRoute(buffer);
            //mqttHelper.publish(FINGERPRINT_DATA_PUBLISH_TOPIC, "RAW ROUTE...");
            break;
        case MSPCommand::SET_RAW_DATA_ENDPOINT_PORT:
            accelRawDataHelper.setEndpointPort(
                uint16_t(strtol(buffer, NULL, 0)));
                //mqttHelper.publish(FINGERPRINT_DATA_PUBLISH_TOPIC, "RAW PORT...");
            break;
        case MSPCommand::SET_RAW_DATA_ENDPOINT_HOST_OEM:
            accelRawDataHelper.setOEMEndpointHost(buffer);
            //mqttHelper.publish(FINGERPRINT_DATA_PUBLISH_TOPIC, "RAW HOST...");
            break;
        case MSPCommand::SET_RAW_DATA_ENDPOINT_ROUTE_OEM:
            accelRawDataHelper.setOEMEndpointRoute(buffer);
            //mqttHelper.publish(FINGERPRINT_DATA_PUBLISH_TOPIC, "RAW ROUTE...");
            break;
        case MSPCommand::SET_RAW_DATA_ENDPOINT_PORT_OEM:
            accelRawDataHelper.setOEMEndpointPort(
                uint16_t(strtol(buffer, NULL, 0)));
                //mqttHelper.publish(FINGERPRINT_DATA_PUBLISH_TOPIC, "RAW PORT...");
            break;
        case MSPCommand::SEND_HTTP_CONNECTION_INFO:
            if(strcmp("EMPTY",buffer) != 0){
                updateConfig(IUESPFlash::CFG_HTTP, buffer,bufferLength-1);
                delay(50);
                hostSerial.sendMSPCommand(MSPCommand::WIFI_ALERT_DISCONNECTED);
                delay(50);
                hostSerial.sendMSPCommand(MSPCommand::MQTT_ALERT_DISCONNECTED);
                delay(50);
                ESP.restart();
            }
            break;
        case MSPCommand::SEND_MQTT_CONNECTION_INFO:
            if(strcmp("EMPTY",buffer) != 0){
                updateConfig(IUESPFlash::CFG_MQTT, buffer,bufferLength-1);
                delay(50);
                hostSerial.sendMSPCommand(MSPCommand::WIFI_ALERT_DISCONNECTED);
                delay(50);
                hostSerial.sendMSPCommand(MSPCommand::MQTT_ALERT_DISCONNECTED);
                delay(50);
                ESP.restart();
            }
            break;
        case MSPCommand::SET_MQTT_SERVER_IP:
           
            if (m_mqttServerValidator.hasTimedOut()) {
                m_mqttServerValidator.reset();
            }
            strncpy(m_mqttServerIP, buffer, IUMQTTHelper::credentialMaxLength);

            m_mqttServerValidator.receivedMessage(0);
            if (m_mqttServerValidator.completed()) {
                mqttHelper.setServer(m_mqttServerIP, m_mqttServerPort);
                //hostSerial.write("RECEIVED MQTT SERVER IP FROM DEVICE ");
            }
            break;
        case MSPCommand::SET_MQTT_SERVER_PORT:
           
            if (m_mqttServerValidator.hasTimedOut()) {
                m_mqttServerValidator.reset();
            }
            m_mqttServerPort = uint16_t(strtol(buffer, NULL, 0));
            m_mqttServerValidator.receivedMessage(1);
            if (m_mqttServerValidator.completed()) {
                mqttHelper.setServer(m_mqttServerIP, m_mqttServerPort);
            }
            break;
        case MSPCommand::SET_MQTT_USERNAME:
            if (m_mqttCredentialsValidator.hasTimedOut()) {
                m_mqttCredentialsValidator.reset();
            }
            strncpy(m_mqttUsername, buffer, IUMQTTHelper::credentialMaxLength);
            m_mqttCredentialsValidator.receivedMessage(0);
            if (m_mqttCredentialsValidator.completed()) {
                mqttHelper.setCredentials(m_mqttUsername, m_mqttPassword);
            }
            break;
        case MSPCommand::SET_MQTT_PASSWORD:
            if (m_mqttCredentialsValidator.hasTimedOut()) {
                m_mqttCredentialsValidator.reset();
            }
            strncpy(m_mqttPassword, buffer, IUMQTTHelper::credentialMaxLength);
            m_mqttCredentialsValidator.receivedMessage(1);
            if (m_mqttCredentialsValidator.completed()) {
                mqttHelper.setCredentials(m_mqttUsername, m_mqttPassword);
            }
            break;
        // case MSPCommand::SET_MQTT_TLS_FLAG:
        //      m_tls_enabled = bool(strtol(buffer, NULL, 0));
        //     //  hostSerial.write("TLS Status :");hostSerial.write(m_tls_enabled);
        //     //  hostSerial.write("\n");
        //      mqttHelper.TLS_ENABLE = m_tls_enabled;
        //     break; 
        /********** Diagnostic Fingerprints Commands **************/    
        case MSPCommand::RECEIVE_DIAGNOSTIC_ACK:
          // Send the Ack to Topic
            mqttHelper.publish(COMMAND_RESPONSE_TOPIC,buffer);
                   
            break;
        case MSPCommand::SEND_DIAGNOSTIC_RESULTS:
              // publish the diagnostic fingerprints results
              mqttHelper.publish(FINGERPRINT_DATA_PUBLISH_TOPIC,buffer);
           break; 
        case MSPCommand::SEND_RAW_DATA:
          {
            memset(ssl_rootca_cert,0x00,sizeof(ssl_rootca_cert));
            memset(ssl_oem_rootca_cert,0x00,sizeof(ssl_oem_rootca_cert));
            //Apply the rootCA cert
            if(activeCertificates == 0){
                //Serial.println("\nUsing ROOTCA 0");
                iuWiFiFlash.readFile(IUESPFlash::CFG_HTTPS_ROOTCA0,ssl_rootca_cert,sizeof(ssl_rootca_cert));
            }else
            {   //Serial.println("\nUsing rootCA 1");
                iuWiFiFlash.readFile(IUESPFlash::CFG_HTTPS_ROOTCA1,ssl_rootca_cert,sizeof(ssl_rootca_cert));
            }

            //Apply the OEM rootCA cert
            if(activeCertificates == 0){
                //Serial.println("\nUsing ROOTCA 0");
                iuWiFiFlash.readFile(IUESPFlash::CFG_HTTPS_OEM_ROOTCA0,ssl_oem_rootca_cert,sizeof(ssl_oem_rootca_cert));
            }else
            {   //Serial.println("\nUsing rootCA 1");
                iuWiFiFlash.readFile(IUESPFlash::CFG_HTTPS_OEM_ROOTCA1,ssl_oem_rootca_cert,sizeof(ssl_oem_rootca_cert));
            }
           IUMessageFormat::rawDataPacket* rawData = (IUMessageFormat::rawDataPacket*) buffer;
            char ack_config[150];

            if (accelRawDataHelper.inputHasTimedOut()) {
                accelRawDataHelper.resetPayload();
            }

            // Only X axis timestamp is recorded so that record times can be correlated on server
            if (rawData->axis == 'X') timestamp = rawData->timestamp;
          
            // This mechanism ensures the ESP sends out only blockSize data points in the POST payload
            // Tried implementing this using structures, but ran into problems. See commented code in 
            //  IUMessage.h for details.
            int rawValuesSize = HOST_BLOCK_SIZE * 2;                // since 1 q15_t occupies 2 bytes
            int httpBufferSize = macIdSize + hostFirmwareVersionSize + timestampSize 
                            + blockSizeSize + samplingRateSize + axisSize + rawValuesSize;      // metadata total size will be constant(43 bytes) + variable block size
            int httpBufferPointer = 0;                      // keeps track of how many bytes are filed in the HTTP buffer 

            memcpy(&httpBuffer[httpBufferPointer], m_bleMAC.toString().c_str(), macIdSize);
            httpBufferPointer += macIdSize;

            memcpy(&httpBuffer[httpBufferPointer], HOST_FIRMWARE_VERSION, hostFirmwareVersionSize);
            httpBufferPointer += hostFirmwareVersionSize;

            memcpy(&httpBuffer[httpBufferPointer], &timestamp, timestampSize);
            httpBufferPointer += timestampSize;

            memcpy(&httpBuffer[httpBufferPointer], &HOST_BLOCK_SIZE, blockSizeSize);            
            httpBufferPointer += blockSizeSize;

            memcpy(&httpBuffer[httpBufferPointer], &HOST_SAMPLING_RATE, samplingRateSize);
            httpBufferPointer += samplingRateSize;

