mahendrakumarshinde/MyRepo/1. IDE_PLUS Firmwares/wifi_station_ESP32/Conductor.cpp
            memcpy(&httpBuffer[httpBufferPointer], &rawData->axis, axisSize);
            httpBufferPointer += axisSize;
            
            memcpy(&httpBuffer[httpBufferPointer], rawData->txRawValues, rawValuesSize);
            httpBufferPointer += rawValuesSize;

            iuSerial->sendMSPCommand(MSPCommand::WIFI_CONFIRM_ACTION, &rawData->axis, 1);
            static int httpOEMStatusCode = 0;
            static int httpStatusCode = 0;
            RawdataHTTPretryCount = 0;
            RawdataHTTPSretryCount = 0;
            bool sendNextAxis = false;
            if((rawData->axis == 'X' || httpStatusCode == 200)){
                while(RawdataHTTPSretryCount < 3 ){
                    if((millis() - HTTPSRawDataTimeout) > HTTPSRawDataRetryTimeout){
                        HTTPSRawDataTimeout = millis();
                        httpStatusCode = httpsPostBigRequest(accelRawDataHelper.m_endpointHost, accelRawDataHelper.m_endpointRoute,
                                                accelRawDataHelper.m_endpointPort, (uint8_t*) &httpBuffer, 
                                                httpBufferPointer,"", ssl_rootca_cert, HttpContentType::octetStream);            

                        // send HTTP status code back to the MCU
                        char httpAckBuffer[1 + 4];      // axis + 3 digit HTTP status code + null terminator
                        httpAckBuffer[0] = rawData->axis;
                        itoa(httpStatusCode, &httpAckBuffer[1], 10);
                        iuSerial->sendMSPCommand(MSPCommand::HTTPS_ACK, httpAckBuffer);

                        // send HTTP status code to MQTT
                        snprintf(ack_config, 150, "{\"messageType\":\"raw-data-ack\",\"mac\":\"%s\",\"httpCode\":\"%d\",\"axis\":\"%c\",\"timestamp\":%.2f}",
                        m_bleMAC.toString().c_str(),httpStatusCode, rawData->axis, timestamp);
                        mqttHelper.publish(COMMAND_RESPONSE_TOPIC, ack_config);
                        if((httpStatusCode == 200)){
                            break;
                        }
                        RawdataHTTPSretryCount++;
                    }
                }
            }
            if((rawData->axis == 'X' || httpOEMStatusCode == 200) && accelRawDataHelper.httpsOEMConfigPresent && oemRootCAPresent){
                while(RawdataHTTPretryCount < 3 ){
                    if((millis() - HTTPRawDataTimeout) > HTTPRawDataRetryTimeout){
                        HTTPRawDataTimeout = millis();
                        httpOEMStatusCode = httpsPostBigRequest(accelRawDataHelper.m_endpointHost_oem, accelRawDataHelper.m_endpointRoute_oem,
                                                        accelRawDataHelper.m_endpointPort_oem, (uint8_t*) &httpBuffer, 
                                                        httpBufferPointer,"", ssl_oem_rootca_cert, HttpContentType::octetStream);            

                        // send HTTP status code back to the MCU
                        char httpOEMAckBuffer[1 + 4];      // axis + 3 digit HTTP status code + null terminator
                        httpOEMAckBuffer[0] = rawData->axis;
                        itoa(httpOEMStatusCode, &httpOEMAckBuffer[1], 10);
                        iuSerial->sendMSPCommand(MSPCommand::HTTPS_OEM_ACK, httpOEMAckBuffer);

                        // send HTTP status code to MQTT
                        snprintf(ack_config, 150, "{\"messageType\":\"raw-data-oem-ack\",\"mac\":\"%s\",\"httpCode\":\"%d\",\"axis\":\"%c\",\"timestamp\":%.2f}",
                        m_bleMAC.toString().c_str(),httpOEMStatusCode, rawData->axis, timestamp);
                        mqttHelper.publish(COMMAND_RESPONSE_TOPIC, ack_config);
                        RawdataHTTPretryCount++;
                        if(httpOEMStatusCode == 200){
                            break;
                        }
                    }
                }
                
            }
            
            if ( (httpStatusCode == 200 || httpOEMStatusCode == 200) && rawData->axis != 'Z'){
                sendNextAxis = true;
            }
           iuSerial->sendMSPCommand(MSPCommand::SEND_RAW_DATA_NEXT_PKT, String(sendNextAxis).c_str());
           break;  
          }
        case MSPCommand::RECEIVE_HTTP_CONFIG_ACK:
          // Send the Ack to Topic
            mqttHelper.publish(COMMAND_RESPONSE_TOPIC,buffer);
                   
            break;
        case MSPCommand::SEND_FLASH_STATUS:
            mqttHelper.publish(DIAGNOSTIC_TOPIC,buffer); 
            break;                
        case MSPCommand::SEND_SENSOR_STATUS:
          // Send the Ack to Topic
            mqttHelper.publish(COMMAND_RESPONSE_TOPIC,buffer);
            break;
        case MSPCommand::DOWNLOAD_TLS_SSL_START:
                certificateDownloadInitInProgress = true;
                certificateDownloadInProgress = true;
                if(downloadAborted  == false && (newEapCertificateAvailable == true || newEapPrivateKeyAvailable == true || 
                    newMqttcertificateAvailable == true || newMqttPrivateKeyAvailable == true || newRootCACertificateAvailable == true || newOEMRootCACertificateAvailable == true/*|| upgradeReceived*/ ) ){
                    // Note : upgradeReceived flage is optional here, in upgrade new cert are having different checksum above all  flags will alreay set to true
                    // added temp for testing upgrade    
                    //Serial.println("\nESP32 DEBUG : DOWNLOADING STARTED ....");
                    publishedDiagnosticMessage(buffer,bufferLength);
                    certificateDownloadStatus = download_tls_ssl_certificates();
                    iuWiFiFlash.updateValue(CERT_DOWNLOAD_STATUS,certificateDownloadStatus);
                    if(certificateDownloadStatus == 1){
                        hostSerial.sendMSPCommand(MSPCommand::CERT_DOWNLOAD_SUCCESS, String(getRca(CERT_DOWNLOAD_COMPLETE)).c_str());
                        if(activeCertificates == 1){
                            if(initialFileDownload){
                                //Serial.println("Initial File Download , Updated Value ");
                                initialFileDownload = false;
                            }
                           activeCertificates = iuWiFiFlash.updateValue(CERT_ADDRESS,0);
                        }else{
                           activeCertificates = iuWiFiFlash.updateValue(CERT_ADDRESS,1);
                        }
                        //Serial.println("\nESP32 DEBUG : DOWNLOADING SUCCESSFULLY COMPLETED....");
                        ESP.restart();
                    }
                }else
                {
                    //Serial.println("\nESP32 DEBUG : No Need to Update the Certificates");
                    hostSerial.sendMSPCommand(MSPCommand::CERT_NO_DOWNLOAD_AVAILABLE, String(getRca(CERT_NEW_CERT_NOT_AVAILBLE)).c_str());
                }
                   
