mahendrakumarshinde/MyRepo/1. IDE_PLUS Firmwares/wifi_station_ESP32/Conductor.cpp
                delay(200);
                resetMqttConnectionFlags();
                certificateDownloadInitInProgress = false;
                newEapCertificateAvailable = false;
                newEapPrivateKeyAvailable = false;
                newMqttcertificateAvailable = false;  
                newMqttPrivateKeyAvailable = false;
                newRootCACertificateAvailable = false;
                if(accelRawDataHelper.httpsOEMConfigPresent){
                        newOEMRootCACertificateAvailable = false;
                    }
                //Serial.println("\nESP32 DEBUG : ALL FLAGS RESET ....");    
                
            break;
        case MSPCommand::UPGRADE_TLS_SSL_START:
             // TODO : Upgrade the Certificate read from the file and Upgrade

            break;
        case MSPCommand::SET_CERT_CONFIG_URL:
          {
            // Store the URL into .conf file
            bool written = iuWiFiFlash.writeFile(IUESPFlash::CFG_STATIC_CERT_ENDPOINT,buffer,bufferLength);  
            if(written && buffer != NULL){
                // Serial.println("\nESP32 DEBUG : static url config type success"); 
                 //downloadInitTimer = true;  
                 if(debugMode){
                     debugPrint("HTTP Certificate Manager Endpoint configured successfully");
                 }
            }else
            {
                // Failed to write to Flash File system, or Empty Buffer received 
                // TODO : Publish status to diagnostic endpoint
                if(!written){
                    hostSerial.sendMSPCommand(MSPCommand::ESP32_FLASH_FILE_WRITE_FAILED);
                    //Serial.println("\nESP32 DEBUG : ESP32_FLASH_FILE_WRITE_FAILED");
                }else if(buffer == NULL ) {
                    //Serial.println("\nESP32 DEBUG : Empty URL received");
                }
                hostSerial.sendMSPCommand(MSPCommand::CERT_INVALID_STATIC_URL);               
                    
            }
            break;
          }
        case MSPCommand::GET_CERT_DOWNLOAD_CONFIG:
          {
            StaticJsonBuffer<512> jsonBuffer;
            JsonVariant config = JsonVariant(iuWiFiFlash.loadConfigJson(IUESPFlash::CFG_STATIC_CERT_ENDPOINT,jsonBuffer));
            bool success = config.success();
            //Serial.print("Certificate Manager JSON :");
            //config.prettyPrintTo(Serial);
            
            if( success && WiFi.isConnected() && Ping.ping("www.google.com" , 1)){
                
                const char* host = config["certUrl"]["host"].as<char*>() ; 
                int port = config["certUrl"]["port"].as<int>() ; 
                const char* path = config["certUrl"]["path"].as<char*>() ;
                String commonUrl = host + String(":") + String(port) + path ;
                commonUrl +=m_bleMAC.toString();   
                const char* staticURL = commonUrl.c_str();
                //Serial.println("\nESP32 DEBUG: GET the Certificates Download Config");
                String auth = setBasicHTTPAutherization();
                //Serial.print("URL : ");Serial.println(staticURL);
                int httpCode = httpGetRequest(staticURL,certDownloadResponse,sizeof(certDownloadResponse),auth); 
                int16_t responseLength = sizeof(certDownloadResponse);
                //Serial.print("\nHTTP CODE : ");Serial.println(httpCode);
                if( responseLength >0 && httpCode == HTTP_CODE_OK  ) {
                    char jsonResponse[responseLength+1];
                    strcpy(jsonResponse,certDownloadResponse);
                        // Checksum valication to check for new cert download
                        messageValidation(jsonResponse);          
                        if( newEapCertificateAvailable || newEapPrivateKeyAvailable ||  newRootCACertificateAvailable || 
                            newMqttcertificateAvailable || newMqttPrivateKeyAvailable || newOEMRootCACertificateAvailable /*|| upgradeReceived*/ )  // Note : upgradeReceived flasg is optional here
                            { 
                                // Store the response message in esp32 flash file system
                                bool configWritten = iuWiFiFlash.writeFile(IUESPFlash::CFG_CERT_UPGRADE_CONFIG,jsonResponse, sizeof(jsonResponse) );
                                if(!configWritten){
                                    // Failed to write to Flash File system 
                                    // TODO : Publish status to diagnostic endpoint
                                    hostSerial.sendMSPCommand(MSPCommand::ESP32_FLASH_FILE_WRITE_FAILED);
                                    //Serial.println("\nESP32 DEBUG : ESP32_FLASH_FILE_WRITE_FAILED");
                                    delay(1); 
                                    //hostSerial.sendMSPCommand(MSPCommand::CERT_DOWNLOAD_ABORT);
                                    hostSerial.sendMSPCommand(MSPCommand::CERT_DOWNLOAD_ABORT,String(getRca(CERT_FILESYSTEM_READ_WRITE_FAILED)).c_str());
                                    downloadAborted = true;
                                    upgradeReceived = false;
                                }else
                                {
                                    //Serial.println("\nESP32 DEBUG : Config JOSN File  Upgrade completed ---------");
                                    hostSerial.sendMSPCommand(MSPCommand::DOWNLOAD_TLS_SSL_START);
                                    downloadAborted = false;
                                    
                                }
                            }
                
                }else
                {
                    // https GET request failed
                    // Send the ACK / NACK to Diagnostic endpoints and inform the STM32 and stop the OTA/Certificate Download mode
                    // TODO : Publish status to diagnostic endpoints
                    // TODO : Get the http error code based on above httpCode 
                    if(httpCode != HTTP_CODE_OK) {
                        // Send the HTTP Faliure Code with RCA
                        //Serial.print("\nESP32 DEBUG : HTTP Failed : "); Serial.println(httpCode);
                        certificateDownloadInProgress =true;    // Set to send the RCA
                        hostSerial.sendMSPCommand(MSPCommand::CERT_DOWNLOAD_ABORT,String(getRca(httpCode)).c_str());
                        certificateDownloadInProgress = false;
                        downloadAborted = true;
                        
