mahendrakumarshinde/MyRepo/1. IDE_PLUS Firmwares/wifi_station_ESP32/Conductor.cpp
                    }
                    downloadAborted = true;
                    upgradeReceived = false;
                    //hostSerial.sendMSPCommand(MSPCommand::CERT_DOWNLOAD_ABORT);
                    //Serial.println("\nESP32 DEBUG :STOP CERT Download Mode");

                }
                
            }else
            {
                // Invalid Response Json or WiFI client not connected 
                // TODO : Publish status to diagnostic endpoint
                if(! WiFi.isConnected() || !success ) {
                    
                    if(!success) {
                        //Serial.println("\nESP32 DEBUG : Invalid Static URL Config JSON Response or File Not available");
                        hostSerial.sendMSPCommand(MSPCommand::CERT_DOWNLOAD_ABORT,String(getRca(CERT_STATIC_URL_FILE_NOT_PRESENT)).c_str() );
                    }else{ 
                        //Serial.println("\nESP32 DEBUG : Wifi client disconnected ");
                    }

                }
                downloadAborted = true;
                upgradeReceived = false;                    
            }
            break;
          }
        
        case MSPCommand::DELETE_CERT_FILES:
            for(int i = 0; i < IUESPFlash::CFG_COUNT;i++){
                iuWiFiFlash.removeFile((IUESPFlash::storedConfig)i);
                delay(1);
            }
            iuWiFiFlash.updateValue(CERT_ADDRESS,0);
            hostSerial.sendMSPCommand(MSPCommand::DELETE_CERT_FILES,"succefully Deleted, Rebooting ESP");
            ESP.restart();
            break;
        case MSPCommand::GET_CERT_CONFIG:
        {
            StaticJsonBuffer<512> JsonBuffer;
            JsonObject& certConfig = iuWiFiFlash.loadConfigJson(IUESPFlash::CFG_STATIC_CERT_ENDPOINT,JsonBuffer);
            bool validConfig = certConfig.success();
            String certConfigChar;
            certConfig.printTo(certConfigChar);
            char certUrlConfig[256];
            sprintf(certUrlConfig,"%s%s","CERT URL CONFIG : ",certConfigChar.c_str());
            //config.prettyPrintTo(Serial);
            if (validConfig)
            {
                hostSerial.sendMSPCommand(MSPCommand::SEND_CERT_DWL_CFG,certUrlConfig);
            }
            JsonObject& diagConfig = iuWiFiFlash.loadConfigJson(IUESPFlash::CFG_DIAGNOSTIC_ENDPOINT,JsonBuffer);
            validConfig = diagConfig.success();
            String diagConfigChar;
            diagConfig.printTo(diagConfigChar);
            char diagUrlConfig[256];
            sprintf(diagUrlConfig,"%s%s","DIAGNOSTIC URL CONFIG : ",diagConfigChar.c_str());
            if (validConfig)
            {
                hostSerial.sendMSPCommand(MSPCommand::SEND_CERT_DIG_CFG,diagUrlConfig);
            }
            break;
        }
        case MSPCommand::READ_CERTS:
            {
                int size1 = iuWiFiFlash.getFileSize(IUESPFlash::CFG_MQTT_CLIENT0);
                int size2 = iuWiFiFlash.getFileSize(IUESPFlash::CFG_MQTT_KEY0);
                int size3 = iuWiFiFlash.getFileSize(IUESPFlash::CFG_CERT_UPGRADE_CONFIG);
                int size4 = iuWiFiFlash.getFileSize(IUESPFlash::CFG_EAP_CLIENT0);
                int size5 = iuWiFiFlash.getFileSize(IUESPFlash::CFG_EAP_KEY0);
                //int size6 = iuWiFiFlash.getConfigFilename(IUESPFlash::CFG_STATIC_CERT_ENDPOINT);
                char cert[size1],eapcert[size3];
                char key[size2] ,eapkey[size5] ;
                char url[200];
                char configdata[size3];
                iuWiFiFlash.readFile(IUESPFlash::CFG_STATIC_CERT_ENDPOINT,url,200);
            
                Serial.println("Static CONFIG :");
                for (size_t i = 0; i < 200; i++)
                {
                    Serial.print(url[i]);
                }
                Serial.println("static config READ COMPLETED");
                break;
            }
      case MSPCommand::SEND_WIFI_HASH:
            strcpy(wifiHash,buffer);
            break;
      case MSPCommand::SEND_MQTT_HASH:
            strcpy(mqttHash,buffer);
            break;
      case MSPCommand::SEND_HTTP_HASH:
            strcpy(httpHash,buffer);
            break;
      case MSPCommand::GET_PENDING_HTTP_CONFIG:
          // Get all the pending configuration messages over http
          
          String response =  accelRawDataHelper.publishConfigMessage(m_bleMAC);
          
          // create the JSON objects 
        //  DynamicJsonBuffer jsonBuffer;
        //  JsonObject& pendingConfigObject = jsonBuffer.parseObject(response); 
          
       /*   String pendingJson;
          
           for (auto configKeyValues : pendingConfigObject) {
               pendingConfigObject["result"][configKeyValues.key];// = configKeyValues.value;
               
             }
           pendingConfigObject.printTo(pendingJson);
        */
         // size_t msgLen = strlen(response);
       //   char fingerprintAlarm[1500];
       //   char featuresThreshold[1500]; 
       //   char fingerprintFeatures[1500];   
          
        //  JsonVariant fingerprintAlarmConfig  = pendingConfigObject["result"]["fingerprintAlarm"];
        //  JsonVariant featuresThresholdConfig = pendingConfigObject["result"]["alarm"];
        //  JsonVariant fingerprintFeaturesConfig = pendingConfigObject["result"]["fingerprint"];
             
          //Serial.println(fingerprintFeaturesConfig.size());
             
       //   fingerprintAlarmConfig.prettyPrintTo(fingerprintAlarm);
       //   featuresThresholdConfig.prettyPrintTo(featuresThreshold);
       //   fingerprintFeaturesConfig.prettyPrintTo(fingerprintFeatures);
          iuSerial->sendLongMSPCommand(MSPCommand::SET_PENDING_HTTP_CONFIG,1000000,response.c_str(),strlen(response.c_str()));
          
          //mqttHelper.publish(COMMAND_RESPONSE_TOPIC, fingerprintAlarm);//response.c_str());
          //mqttHelper.publish(COMMAND_RESPONSE_TOPIC, featuresThreshold);
          //mqttHelper.publish(COMMAND_RESPONSE_TOPIC, fingerprintFeatures);
          //mqttHelper.publish(COMMAND_RESPONSE_TOPIC, response.c_str());
          break;
            
