mahendrakumarshinde/MyRepo/1. IDE_PLUS Firmwares/wifi_station_ESP32/Conductor.cpp
    }
}



/* =============================================================================
    WiFi credentials and config
============================================================================= */

void Conductor::forceWiFiConfig(const char *userSSID, const char *userPSK,
                                IPAddress staticIp, IPAddress gateway,
                                IPAddress subnetMask)
{
    // Credentials
    forgetWiFiCredentials();
    strncpy(m_userSSID, userSSID, wifiCredentialLength);
    strncpy(m_userPassword, userPSK, wifiCredentialLength);
    m_credentialValidator.receivedMessage(0);
    m_credentialValidator.receivedMessage(1);
    // Static IP
    forgetWiFiStaticConfig();
    m_staticIp = staticIp;
    m_gateway = gateway;
    m_subnetMask = subnetMask;
    m_staticConfigValidator.receivedMessage(0);
    m_staticConfigValidator.receivedMessage(1);
    m_staticConfigValidator.receivedMessage(2);
    m_disconnectionTimerStart = millis();  // Reset Disconnection timer
}

/**
 *
 */
void Conductor::forgetWiFiCredentials()
{
    m_credentialValidator.reset();
    for (uint8_t i = 0; i < wifiCredentialLength; ++i)
    {
        m_userSSID[i] = 0;
        m_userPassword[i] = 0;
        m_username[i] = 0;
    }
}

/**
 * Receive new WiFi credentials (SSID and / or PSK)
 */
void Conductor::receiveNewCredentials(char *newSSID, char *newPSK)
{
    if (m_credentialValidator.hasTimedOut())
    {
        forgetWiFiCredentials();
    }
    if (newSSID)
    {
        m_credentialValidator.reset();
        memset(m_userSSID,0x00,wifiCredentialLength);
        memset(m_userPassword,0x00,wifiCredentialLength);
        strncpy(m_userSSID, newSSID, wifiCredentialLength);
        m_credentialValidator.receivedMessage(0);
    }
    if (newPSK)
    {
        strncpy(m_userPassword, newPSK, wifiCredentialLength);
        m_credentialValidator.receivedMessage(1);
    }
    if (m_credentialValidator.completed())
    {
        String info = String(m_userSSID) + "_" + String(m_userPassword);
        hostSerial.sendMSPCommand(MSPCommand::WIFI_CONFIRM_NEW_CREDENTIALS,
                                  info.c_str());
        // Reset disconnection timer before reconnection attempt
        m_disconnectionTimerStart = millis();
        m_disconnectionMqttTimerStart = millis();
        reconnect(true);
    }
}

/**
 *
 */
void Conductor::forgetWiFiStaticConfig()
{
    m_staticConfigValidator.reset();
    m_staticIp = IPAddress();
    m_gateway = IPAddress();
    m_subnetMask = IPAddress();
    m_dns1 = IPAddress();
    m_dns2 = IPAddress();
}

/**
 * Receive new WiFi static config (static IP, gateway or subnet mask).
 *
 * @param ip: The IP address of either the static IP, gateway or subnet mask.
 * @param idx: An index 0, 1 or 2 corresponding to the kind of IP (static IP,
    gateway or subnet mask)
 */
void Conductor::receiveNewStaticConfig(IPAddress ip, uint8_t idx)
{
    if (m_staticConfigValidator.hasTimedOut())
    {
        forgetWiFiStaticConfig();
    }
    if (idx == 0) { m_staticIp = hostSerial.mspReadIPAddress(); }
    else if (idx == 1) { m_gateway = hostSerial.mspReadIPAddress(); }
    else if (idx == 2) { m_subnetMask = hostSerial.mspReadIPAddress(); }
    else if (idx == 3) { m_dns1 = hostSerial.mspReadIPAddress(); }
    else if (idx == 4) { m_dns2 = hostSerial.mspReadIPAddress(); }
    else { return; }
    m_staticConfigValidator.receivedMessage(idx);
    if (m_staticConfigValidator.completed())
    {
        hostSerial.sendMSPCommand(MSPCommand::WIFI_CONFIRM_NEW_STATIC_CONFIG);
        // Reset disconnection timer before reconnection attempt
        m_disconnectionTimerStart = millis();
        reconnect(true);
    }
}

/**
 * Request host to know if should sleep & get BLE MAC address.
 *
 * If the host has not answered after hostResponseTimeout, the ESP82 will deep-
 * sleep for deepSleepDuration and then restart.
 */
bool Conductor::getConfigFromMainBoard()
{
    uint32_t startTime = millis();
    uint32_t current = startTime;
    while (uint64_t(m_bleMAC) == 0 && (millis() - startTime) < 2000 )
    {
        if (current - startTime > hostResponseTimeout)
        {   
            if (debugMode)
            {
                debugPrint("Host didn't respond");
            }
            deepsleep();
        }
        delay(500);
        hostSerial.sendMSPCommand(MSPCommand::ASK_BLE_MAC);
         
        // get the IDE Firmware Version from Host
        //hostSerial.sendMSPCommand(MSPCommand::ASK_HOST_FIRMWARE_VERSION);
        m_lastMQTTInfoRequest = current;
        delay(100);
        hostSerial.readMessages();
        current = millis();
    }
    return (uint64_t(m_bleMAC) > 0);
}


/* =============================================================================
    Wifi connection and status
============================================================================= */

/**
 * Disconnect the clients and the WiFi
 *
 * @param wifiOff If true, set WiFi mode to WIFI_OFF.
 */
void Conductor::disconnectWifi(bool wifiOff)
{
    /***** End NTP server connection *****/
    timeHelper.end();
    /***** Disconnect MQTT client *****/
    if (mqttHelper.client.connected())
    {
        mqttHelper.client.disconnect();
    }
    /***** Turn off Wifi *****/
    if (WiFi.isConnected())
    {
        WiFi.disconnect(wifiOff);
    }
}
String Conductor :: IpAddress2String(const IPAddress& ipAddress)
{
  return String(ipAddress[0]) + String(".") +\
  String(ipAddress[1]) + String(".") +\
  String(ipAddress[2]) + String(".") +\
  String(ipAddress[3])  ; 
}
/**
 * Disconnect the clients 
 *
 * @param .
 */
void Conductor::disconnectMQTT()
{
    /***** End NTP server connection *****/
    timeHelper.end();
    /***** Disconnect MQTT client *****/
    if (mqttHelper.client.connected())
    {
        mqttHelper.client.disconnect();
    }
}

/**
 * Attempt to connect or reconnect to the WiFi
 *
 * If the WiFi is already connected to the "right" network (see param
 * forceNewCredentials), this function will not affect the Wifi connection.
 *
 * @param forceNewCredentials If true, the function will connect to the
 * user-input SSID and password (m_userSSID and m_userPassword). If the WiFi is
 * already connected to a network with a different SSID and password, this
 * former connection will be interrupted to use the new credentials.
 */
bool Conductor::reconnect(bool forceNewCredentials)
{
    // Ensure that the WiFi is in STA mode (STA only, no AP)
    if (WiFi.getMode() != WIFI_STA)
    {
        WiFi.mode(WIFI_STA);
    }
    // Disconnect the WiFi if new credentials
    if (forceNewCredentials)
    {
        String currentSSID = WiFi.SSID();
        String currentPW = WiFi.psk();
        if (currentSSID.length() == 0 ||
            strcmp(currentSSID.c_str(), m_userSSID) > 0 ||
            currentPW.length() == 0 ||
            strcmp(currentPW.c_str(), m_userPassword) > 0 ||
            !(WiFi.localIP() == m_staticIp) ||
            !(WiFi.gatewayIP() == m_gateway) ||
            !(WiFi.subnetMask() == m_subnetMask))
        {
            // New and different user input for SSID and Password => disconnect
            // from current SSID then reconnect to new SSID
            // ESP.eraseConfig();  // ESP32_PORT_TRUE
            disconnectWifi();
            delay(1000);  // Wait for effective disconnection
        }
    }
    uint32_t current = millis();
    // Connect the WiFi if not connected
    bool wifiConnected = WiFi.isConnected();
    if (!wifiConnected) {
        if (current - m_lastConnectionAttempt < reconnectionInterval) {
            if (debugMode) {
                debugPrint("Not enough time since last connection attempt");
            }
            return false;
        }
        if (!m_credentialValidator.completed()) {
            if (debugMode) {
                debugPrint("Can't connect without credentials");
            }
            return false;
        }

        connectToWiFi();

        m_lastConnectionAttempt = current;
        wifiConnected = (waitForConnectResult() == WL_CONNECTED);
        if (debugMode && wifiConnected) {
            debugPrint("Connected to ", false);
            debugPrint(WiFi.SSID());
        }
    }
    // Set light sleep mode if not done // ESP32_PORT_TRUE
    if (wifiConnected && WiFi.getSleep() != WIFI_PS_MIN_MODEM) {
        WiFi.setSleep(WIFI_PS_MIN_MODEM);
    }
    return wifiConnected;
}

void Conductor::connectToWiFi(){

