mahendrakumarshinde/MyRepo/1. IDE_PLUS Firmwares/wifi_station_ESP32/Conductor.cpp
                if(Ptr != NULL ) {
                    Ptr = strstr(payload,"initiateota");
                    if(Ptr != NULL )
                        otaReqReceived = true;
                }
                if(otaReqReceived)
                {     
                    otaInProgress = true;
                    hostSerial.sendMSPCommand(MSPCommand::OTA_INIT_REQUEST);
                    delay(1500);
                    hostSerial.sendLongMSPCommand(
                    MSPCommand::CONFIG_FORWARD_CONFIG, 3000000, payload, length);
                    otaInitTimeout = millis();
                    otaInitTimeoutFlag = true;
                }                
                else
                {
                        // Command is longer than TX buffer, send it while taking care to not
                    // overflow the buffer. Timeout parameter is in microseconds.
                    hostSerial.sendLongMSPCommand(
                        MSPCommand::CONFIG_FORWARD_CONFIG, 3000000, payload, length);
                }
            }
            else
            {
                hostSerial.sendMSPCommand(MSPCommand::CONFIG_FORWARD_CONFIG, payload,
                                        length);
            }
        }
    }
    else if (strncmp(&subTopic[1], "command", 7) == 0)
    {
        if(otaInProgress == false) {
                
            hostSerial.sendMSPCommand(MSPCommand::CONFIG_FORWARD_CMD,
                                    payload, length);
        }
    }
    else if (strncmp(&subTopic[1], "legacy", 6) == 0)
    {
        if (payload[0] == '1' && payload[1] == ':')
        {
            timeHelper.updateTimeReferenceFromIU(&payload[2]);
            hostSerial.sendMSPCommand(MSPCommand::SET_DATETIME, &payload[2],
                                      length);
        }
        else
        {
            if(otaInProgress == false) {
                hostSerial.sendMSPCommand(MSPCommand::CONFIG_FORWARD_LEGACY_CMD,
                                        payload, length);
            }
        }
    }
    else if (strncmp(&subTopic[1], "post_url", 8) == 0)
    {
        if(otaInProgress == false) {
            //TODO Improve url management
            if (length < MAX_HOST_LENGTH)
            {
                strncpy(m_featurePostHost, payload, length);
                strncpy(m_diagnosticPostHost, payload, length);
            }
        }
    }
}

/* =============================================================================
    Data posting / publication
============================================================================= */

/**
 *
 */
bool Conductor::publishDiagnostic(const char *rawMsg, const uint16_t msgLength,
                                  const char *diagnosticType,
                                  const uint16_t diagnosticTypeLength)
{
    char stringDT[25];  // Remove the newline at the end of ctime
    time_t datetime = timeHelper.getCurrentTime();
    strncpy(stringDT, ctime(&datetime), 25);
    stringDT[24] = 0;
    if (m_useMQTT)
    {
        uint16_t totalMsgLength = msgLength + CUSTOMER_PLACEHOLDER_LENGTH + 50;
        char message[totalMsgLength];
        snprintf(message, totalMsgLength, "%s;;;%s;;;%s;;;%s",
                 CUSTOMER_PLACEHOLDER, m_bleMAC.toString().c_str(),
                 stringDT, rawMsg);
        return mqttHelper.publishDiagnostic(message, diagnosticType,
                                            diagnosticTypeLength);
    } else {
        uint16_t totalMsgLength = msgLength + CUSTOMER_PLACEHOLDER_LENGTH + 98;
        char message[totalMsgLength];
        snprintf(message, totalMsgLength,
                 "{\"payload\":\"%s;;;%s;;;%s;;;%s\",\"time\":\"%s\"}",
                 // payload value
                 CUSTOMER_PLACEHOLDER, m_bleMAC.toString().c_str(), stringDT,
                 rawMsg,
                 // time value
                 stringDT);
        uint16_t routeLength = strlen(DIAGNOSTIC_DEFAULT_ENDPOINT_ROUTE) + 17;
        char route[routeLength];
        snprintf(route, routeLength, "%s%s", DIAGNOSTIC_DEFAULT_ENDPOINT_ROUTE,
                 m_bleMAC.toString().c_str());
        return httpPostBigRequest(
            m_diagnosticPostHost, route, m_diagnosticPostPort,
            (uint8_t*) message, totalMsgLength);
    }
}

/**
 *
 */
bool Conductor::publishFeature(const char *rawMsg, const uint16_t msgLength,
                               const char *featureType,
                               const uint16_t featureTypeLength)
{
    char stringDT[25];  // Remove the newline at the end of ctime
    time_t datetime = timeHelper.getCurrentTime();
    strncpy(stringDT, ctime(&datetime), 25);
    stringDT[24] = 0;
    if (m_useMQTT)
    {
        uint16_t totalMsgLength = msgLength + CUSTOMER_PLACEHOLDER_LENGTH + 24;
        char message[totalMsgLength];
        snprintf(message, totalMsgLength, "%s;;;%s;;;%s", CUSTOMER_PLACEHOLDER,
                 m_bleMAC.toString().c_str(), rawMsg);
        return mqttHelper.publishFeature(message, featureType,
                                         featureTypeLength);
    }
    else
    {
        uint16_t totalMsgLength = msgLength + CUSTOMER_PLACEHOLDER_LENGTH + 72;
        char message[totalMsgLength];
        snprintf(message, totalMsgLength,
                 "{\"payload\":\"%s;;;%s;;;%s\",\"time\":\"%s\"}",
                 // payload value
                 CUSTOMER_PLACEHOLDER, m_bleMAC.toString().c_str(), rawMsg,
                 // time value
                 stringDT);
        uint16_t routeLength = strlen(FEATURE_DEFAULT_ENDPOINT_ROUTE) + 17;
        char route[routeLength];
        snprintf(route, routeLength, "%s%s", FEATURE_DEFAULT_ENDPOINT_ROUTE,
                 m_bleMAC.toString().c_str());
        return httpPostBigRequest(
            m_featurePostHost, route, m_featurePostPort,
            (uint8_t*) message, totalMsgLength);

    }
}


/* =============================================================================
    Cyclic Update
============================================================================= */

/**
 * Format and output wifi info into a JSON-parsable char array.
 *
 * @param destination A char array to hold the function output. Must be at least
 *  250 char long.
 */
void Conductor::getWifiInfo(char *destination, uint16_t len, bool mqttOn)
{
    for (uint16_t i = 0; i < len; ++i)
    {
        destination[i] = 0;
    }
    if (len < 250)
    {
        if (debugMode)
        {
            debugPrint("destination char array is too short to "
                       "get WiFi Info");
        }
        return;
    }
    strcpy(destination, "{\"ssid\":\"");
    strcat(destination, WiFi.SSID().c_str());
    strcat(destination, "\",\"rssi\":");
    strcat(destination, String(WiFi.RSSI()).c_str());
    strcat(destination, ",\"local_ip\":\"");
    strcat(destination, WiFi.localIP().toString().c_str());
    strcat(destination, "\",\"subnet\":\"");
    strcat(destination, WiFi.subnetMask().toString().c_str());
    strcat(destination, "\",\"gateway\":\"");
    strcat(destination, WiFi.gatewayIP().toString().c_str());
    strcat(destination, "\",\"dns\":\"");
    strcat(destination, WiFi.dnsIP().toString().c_str());
    strcat(destination, "\",\"wifi_mac\":\"");
    strcat(destination, m_wifiMAC.toString().c_str());
    strcat(destination, "\",\"MQTT\":\"");
    if (mqttOn)
    {
        strcat(destination, "on");
    } else {
        strcat(destination, "off");
    }
    strcat(destination, "\"}");
}

/**
 * Publish a diagnostic message to the cloud about the WiFi connection & IDE & Wifi Firmware Version.
 */
void Conductor::publishWifiInfo()
{
    if (WiFi.isConnected() && mqttHelper.client.connected())
    {
        char message[256];
        getWifiInfo(message, 256, true);
        publishDiagnostic(message, strlen(message));
    }
}

/**
 * Periodically publish the WiFi info (see publishWifiInfo).
 */
void Conductor::publishWifiInfoCycle()
{
    if (WiFi.isConnected() && mqttHelper.client.connected())
    {
        uint32_t now = millis();
        if (now - m_lastWifiInfoPublication > wifiInfoPublicationDelay)
        {
            publishWifiInfo();
            m_lastWifiInfoPublication = now;
        }
    }
}

/**
 * Send a message to the host MCU to inform about the WiFi status.
 */
void Conductor::updateWiFiStatus()
{
    if (WiFi.isConnected() /*&& mqttHelper.client.connected()*/)
    {
        hostSerial.sendMSPCommand(MSPCommand::WIFI_ALERT_CONNECTED);
        //Serial.println("\nWIFI CONNECTED");
    }
    else
    {
        hostSerial.sendMSPCommand(MSPCommand::WIFI_ALERT_DISCONNECTED);
        //Serial.println("WIFI DISCONECTED");
    }
}
/**
 * @brief Send a message to host MCU to inform about the MQTT connection status
 * 
 */
void Conductor::updateMQTTStatus()
{
    if (mqttHelper.client.connected())
    {
        hostSerial.sendMSPCommand(MSPCommand::MQTT_ALERT_CONNECTED);
        //Serial.println("MQTT CONNECTED");
    }
    else
    {
        hostSerial.sendMSPCommand(MSPCommand::MQTT_ALERT_DISCONNECTED);
        //Serial.println("MQTT DISCONNECTED");
    }
}
/**
 * Periodically update the host MCU about the WiFi status (see updateWiFiStatus).
 */
void Conductor::updateWiFiStatusCycle()
{
    uint32_t now = millis();
    if (now - m_lastWifiStatusUpdate > wifiStatusUpdateDelay)
    {
        updateWiFiStatus();
        updateMQTTStatus();
        m_lastWifiStatusUpdate = now;
    }
}

/**
 * Periodically check WiFi status, if disconnected, try to connect using saved credentials
 */
void Conductor::autoReconncetWifi()
{
    uint32_t now = millis();
    if (now - m_lastWifiStatusCheck > (wifiStatusUpdateDelay))
    {
        setWiFiConfig();
        //connectToWiFi();
        m_lastWifiStatusCheck = now;
    }
}

