mahendrakumarshinde/MyRepo/1. IDE_PLUS Firmwares/wifi_station_ESP32/Conductor.cpp
/* =============================================================================
    Debugging
============================================================================= */

/**
 *
 */
void Conductor::debugPrintWifiInfo()
{
    #if IUDEBUG_ANY == 1
    WiFiMode_t currMode = WiFi.getMode();
    debugPrint("WiFi mode: ", false);
    debugPrint((uint8_t) currMode);
    if (currMode == WIFI_STA)
    {
        debugPrint("WiFi SSID: ", false);
        debugPrint(WiFi.SSID());
        debugPrint("WiFi psk: ", false);
        debugPrint(WiFi.psk());
        debugPrint("WiFi RSSI: ", false);
        debugPrint(WiFi.RSSI());
    }
    debugPrint("User SSID: ", false);
    debugPrint(m_userSSID);
    debugPrint("User psk: ", false);
    debugPrint(m_userPassword);
    #endif
}

/* =================================================================================
 *  get Device latest Firmware versions
 *  Function Name: sendDeviceFirmwareVersion 
 *  return : buffer with IDE and Wifi Firmware
 *  Output Format : JSON
 *  {"IDE-FIRMWARE-VR": "x.x.x", "WIFI-FIRMWARE-VR": "x.x.x"} 
 *==================================================================================*/

 void Conductor:: getDeviceFirmwareVersion(char* destination,char* HOST_VERSION, const char* WIFI_VERSION){
      //Ask Host firmware version
      //hostSerial.sendMSPCommand(MSPCommand::ASK_HOST_FIRMWARE_VERSION);
     
     uint8_t len = 255; //sizeof(destination)/sizeof(destination[0]); 
      
    for (uint16_t i = 0; i < len; ++i)
    {
        destination[i] = 0;
    }
    /*if (len < 250)  
    { 
      if (debugMode)
      {
          debugPrint("destination char array is too short to "
                         "get Version Info");
       }
          return;
    }
     */
    strcpy(destination, "{\"ide-firmware-version\":\"");
    strcat(destination, HOST_VERSION);
    strcat(destination, "\",\"wifi-firmware-version\":\"");
    strcat(destination, WIFI_VERSION);
    strcat(destination, "\",\"wifi_mac\":\"");
    strcat(destination, m_wifiMAC.toString().c_str());
    strcat(destination, "\",\"ble_mac\":\"");
    strcat(destination, m_bleMAC.toString().c_str());
    strcat(destination, "\",\"mqtt\":\"");
    strcat(destination, "on");
    /*if (mqttOn)
    {
        strcat(destination, "on");
    } else {
        strcat(destination, "off");
    }*/
    strcat(destination, "\"}");    
 }


bool Conductor:: otaDnldFw(bool otaDnldProgress)
{
  //  char TestStr[128];
    if(otaDnldProgress == false) 
    {
 //       otaInProgress = true;
        if(WiFi.status() == WL_CONNECTED) 
        {
            http_ota.end(); //  in case of error... need to close handle as it defined global
            http_ota.setTimeout(otaHttpTimeout);
            http_ota.setConnectTimeout(otaHttpTimeout);
           // hostSerial.sendLongMSPCommand(MSPCommand::ESP_DEBUG_TO_STM_HOST,300000,ota_uri,512);
            totlen = 0;
            contentLen = 0;
            otaStsDataSent = false;
            uint8_t http_init_retry = 0;
            while(http_init_retry < MAX_HTTP_INIT_RETRY) 
            {
                if(http_ota.begin(ota_uri)) 
                {
                    http_init_retry = MAX_HTTP_INIT_RETRY;
                    int httpCode = http_ota.GET();
                    // httpCode will be negative on error
                    if(httpCode > 0)
                    {
                        // file found at server
                        if(httpCode == HTTP_CODE_OK)
                        {
                            contentLen = http_ota.getSize();
                            if(!strcmp(ota_uri,otaStm_uri))
                            {
                                if(contentLen == 0 || contentLen > MAX_MAIN_FW_SIZE)
                                {
                                    hostSerial.sendMSPCommand(MSPCommand::OTA_DNLD_FAIL,String(getRca(OTA_INVALID_MAIN_FW_SIZE)).c_str());
                                    waitingForPktAck = false;
                                    http_ota.end();
                                    return false;                           
                                }
                            }
                            else if(!strcmp(ota_uri,otaEsp_uri))
                            {
                                if(contentLen == 0 || contentLen > MAX_WIFI_FW_SIZE)
                                {
                                    hostSerial.sendMSPCommand(MSPCommand::OTA_DNLD_FAIL,String(getRca(OTA_INVALID_WIFI_FW_SIZE)).c_str());
                                    waitingForPktAck = false;
                                    http_ota.end();
                                    return false;                             
                                }                            
                            }
                            fwdnldLen = contentLen;
    //                      sprintf(TestStr,"contentLen:%d",contentLen);
    //                      hostSerial.sendMSPCommand(MSPCommand::ESP_DEBUG_TO_STM_HOST,TestStr,32);
                            delay(100);
                            // get tcp stream
                            WiFiClient * stream = http_ota.getStreamPtr();
                            // read all data from server
                            uint32_t otaStramStr = millis();
                            size_t size = 0;
                            do {
                                size = stream->available();
                                if(size > 0 || ((millis() - otaStramStr) > otaPktReadTimeout))
                                    break;
                            } while(http_ota.connected());
                            if(size) {
                                // read up to 1024 byte
        //                        int c = stream->readBytes(ota_buff, ((size > sizeof(ota_buff)) ? sizeof(ota_buff) : size));
        //                        hostSerial.sendLongMSPCommand(MSPCommand::OTA_PACKET_DATA, 2000000, (const char*) ota_buff, OTA_PACKET_SIZE);

                                int c = stream->readBytes(httpBuffer, ((size > OTA_PACKET_SIZE) ? OTA_PACKET_SIZE : size));
                                hostSerial.sendLongMSPCommand(MSPCommand::OTA_PACKET_DATA, 5000000, (const char*) httpBuffer, c);
                                pktWaitTimeStr  = millis();
                                waitingForPktAck = true;
                                if(contentLen > 0) {
                                    totlen = totlen + c;
                                    contentLen -= c;
        //                            sprintf(TestStr,"Pkt:%d Read:%d Rem:%d",c,totlen,contentLen);
        //                            hostSerial.sendMSPCommand(MSPCommand::ESP_DEBUG_TO_STM_HOST,TestStr,32);
                                }                        
                            }
                            else if(size == 0 || ((millis() - otaStramStr) > otaPktReadTimeout))
                            { // Read timeout
                                hostSerial.sendMSPCommand(MSPCommand::OTA_DNLD_FAIL,String(getRca(OTA_DATA_READ_TIMOUT)).c_str());//"DATA_READ_TIMOUT");
                                waitingForPktAck = false;
                            }
                            delay(1);
                        }
                        else
                        {
                        // sprintf(TestStr,"HTTP FAIL:%d",httpCode);
                            hostSerial.sendMSPCommand(MSPCommand::OTA_DNLD_FAIL,String(getRca(httpCode)).c_str());
                            waitingForPktAck = false;
                            http_ota.end();
                        }
                    } 
                    else
                    {            
                        hostSerial.sendMSPCommand(MSPCommand::OTA_DNLD_FAIL,String(getRca(httpCode)).c_str());
                        waitingForPktAck = false;
                        http_ota.end();                    
                    }
                }
                else
                {               
                    http_init_retry++;
                    waitingForPktAck = false;
                    http_ota.end();
                    delay(2000);
                    if(http_init_retry == MAX_HTTP_INIT_RETRY)
                    { 
                        hostSerial.sendMSPCommand(MSPCommand::OTA_DNLD_FAIL,String(getRca(OTA_HTTP_INIT_FAIL)).c_str());//"HTTP_INIT_FAIL");
                        delay(1);
                        return false;
                    }      
                }
            } //  while(http_init == false && http_init_retry < MAX_HTTP_INIT_RETRY)
        }
        else
        {
            // FW Download was initiated... but failed due to WiFi disconnect
            hostSerial.sendMSPCommand(MSPCommand::OTA_DNLD_FAIL,String(getRca(OTA_WIFI_DISCONNECT)).c_str());//"WIFI_DISCONNECT");
            http_ota.end();
            waitingForPktAck = false;
            return false;       
        }
    }
    else
    {
        if(WiFi.status() == WL_CONNECTED) 
        {
            if(contentLen > 0)
            {
                http_ota.setTimeout(otaHttpTimeout);
                http_ota.setConnectTimeout(otaHttpTimeout);
                // get tcp stream
                uint8_t otaMod10Per = ((100 - (((fwdnldLen-contentLen)*100)/fwdnldLen))%10);
                //if((((100 - (((fwdnldLen-contentLen)*100)/fwdnldLen))%10) == 0) && (otaStsDataSent == false))
                if(otaMod10Per == 0 && otaStsDataSent == false) 
                { /* Send OTA Status on every 10 % completion on MQTT Diag.(iu_err) topic */     
                    char percent[24];
                    otaStsDataSent = true;
                    memset(percent,0x00, 24);
                    if(!strcmp(ota_uri,otaStm_uri))
                    {
                        sprintf(percent,"Main FW DNLD: %d %% ",(((((fwdnldLen-contentLen)*100)/fwdnldLen))));
                    }
                    else if(!strcmp(ota_uri,otaEsp_uri))
                    {
                        sprintf(percent,"WiFi FW DNLD: %d %% ",(((((fwdnldLen-contentLen)*100)/fwdnldLen))));
                    }
                    //hostSerial.sendMSPCommand(MSPCommand::ESP_DEBUG_TO_STM_HOST,percent,20);
                    //sprintf(percent,"Main_FW:%03d %%",(((((fwdnldLen-contentLen)*100)/fwdnldLen))));
                    percent[20] = '\0';
                    char otaSts[128];
                    snprintf(otaSts, 128, "{\"deviceId\":\"%s\",\"type\":\"%s\",\"status\":\"%s\"}",m_bleMAC.toString().c_str(), "vEdge",percent);
                    mqttHelper.publish(OTA_P_TOPIC,otaSts);
                    delay(1);
                }
                else if(otaMod10Per != 0 && otaStsDataSent == true)
                {
                    otaStsDataSent = false;
                }

                WiFiClient * stream = http_ota.getStreamPtr();
                // read all data from server
                // get available data size
                uint32_t otaStramStr = millis();
                size_t size = 0;
                do {
                    size = stream->available();
                    if(size > 0 || ((millis() - otaStramStr) > otaPktReadTimeout))
                        break;
                } while(http_ota.connected());

                if(size) {
                    // read up to 1024 byte
//                    int c = stream->readBytes(ota_buff, ((size > sizeof(ota_buff)) ? sizeof(ota_buff) : size));
//                    hostSerial.sendLongMSPCommand(MSPCommand::OTA_PACKET_DATA, 2000000, (const char*) ota_buff, OTA_PACKET_SIZE);

                    uint16_t c = stream->readBytes(httpBuffer, ((size > OTA_PACKET_SIZE) ? OTA_PACKET_SIZE : size));
                    hostSerial.sendLongMSPCommand(MSPCommand::OTA_PACKET_DATA, 5000000, (const char*) httpBuffer, c);
                    pktWaitTimeStr  = millis();
                    waitingForPktAck = true;
                    if(contentLen > 0) {
                        totlen = totlen + c;
                        contentLen -= c;
         //               sprintf(TestStr,"Pkt:%d Read:%d Rem:%d",c,totlen,contentLen);
         //               hostSerial.sendMSPCommand(MSPCommand::ESP_DEBUG_TO_STM_HOST,TestStr,32);
                    }
                }
                else if(size == 0 || ((millis() - otaStramStr) > otaPktReadTimeout))
                { // Read timeout
                    hostSerial.sendMSPCommand(MSPCommand::OTA_DNLD_FAIL,String(getRca(OTA_DATA_READ_TIMOUT)).c_str());//"DATA_READ_TIMOUT");
                    waitingForPktAck = false;
                }
                delay(1);
            }
            else
            {
                if(fwdnldLen == totlen)
                {
                    if(strcmp(ota_uri,otaStm_uri) == 0)
                    {
                        hostSerial.sendMSPCommand(MSPCommand::OTA_STM_DNLD_STATUS);
                        delay(5);
                        char percent[24];
                        char otaSts[128];
                        strcpy(percent,"Main FW DNLD: 100 %");
                        snprintf(otaSts, 128, "{\"deviceId\":\"%s\",\"type\":\"%s\",\"status\":\"%s\"}",m_bleMAC.toString().c_str(), "vEdge",percent);
                        mqttHelper.publish(OTA_P_TOPIC,otaSts);
                        fwdnldLen = 0;
                        totlen = 0;
                        waitingForPktAck = false;
                        http_ota.end();
                    }
                    if(strcmp(ota_uri,otaEsp_uri) == 0)
                    {
                        hostSerial.sendMSPCommand(MSPCommand::OTA_ESP_DNLD_STATUS);
                        delay(5);
                        char percent[24];
                        char otaSts[128];
                        strcpy(percent,"WiFi FW DNLD: 100 %");
                        snprintf(otaSts, 128, "{\"deviceId\":\"%s\",\"type\":\"%s\",\"status\":\"%s\"}",m_bleMAC.toString().c_str(), "vEdge",percent);
                        mqttHelper.publish(OTA_P_TOPIC,otaSts);
                        fwdnldLen = 0;
                        totlen = 0;
                        waitingForPktAck = false;
                        http_ota.end();
                    }                                        
                }
            }            
        }
        else
        {
            if(fwdnldLen != totlen && contentLen > 0)
            { // FW Download is not completed... and was in progress
                hostSerial.sendMSPCommand(MSPCommand::OTA_DNLD_FAIL,String(getRca(OTA_WIFI_DISCONNECT)).c_str());//"WIFI_DISCONNECT");
            }
            http_ota.end();
            waitingForPktAck = false;
            return false;  
        }        
    }
}

/**
 * Get RCA Reason code based on HTTP error code value
 * @param error int
 * @return String
 * OTA-RCA-0001 to OTA-RCA-0010 - Used at STM code for sending OTA Failure reason code
 * 
 */
String Conductor::getRca(int error)
{   
    switch(error) {
        case OTA_WIFI_DISCONNECT:
            /* WiFi Disconnection error handled both at STM and ESP, with same RCA Code = 3  */
            if(certificateDownloadInProgress){ return F("CERT-RCA-0003");}else{ return F("OTA-RCA-0003"); }
        case OTA_HTTP_INIT_FAIL:
            return F("OTA-RCA-0011");
        case OTA_DATA_READ_TIMOUT:
            return F("OTA-RCA-0012");
        case OTA_STM_PKT_ACK_TMOUT:
            return F("OTA-RCA-0013");
        case HTTPC_ERROR_CONNECTION_REFUSED:
            if(certificateDownloadInProgress){ return F("CERT-RCA-0014");}else{ return F("OTA-RCA-0014"); }
        case HTTPC_ERROR_SEND_PAYLOAD_FAILED:
            if(certificateDownloadInProgress){ return F("CERT-RCA-0015");}else{ return F("OTA-RCA-0015"); }
        case HTTPC_ERROR_NOT_CONNECTED:
            if(certificateDownloadInProgress){ return F("CERT-RCA-0016");}else{ return F("OTA-RCA-0016"); }
        case HTTPC_ERROR_CONNECTION_LOST:
            if(certificateDownloadInProgress){ return F("CERT-RCA-0017");}else{ return F("OTA-RCA-0017"); }
        case HTTPC_ERROR_NO_STREAM:
            if(certificateDownloadInProgress){ return F("CERT-RCA-0018");}else{ return F("OTA-RCA-0018"); }
        case HTTPC_ERROR_NO_HTTP_SERVER:
            if(certificateDownloadInProgress){ return F("CERT-RCA-0019");}else{ return F("OTA-RCA-0019"); }
        case HTTPC_ERROR_TOO_LESS_RAM:
             if(certificateDownloadInProgress){ return F("CERT-RCA-0020");}else{ return F("OTA-RCA-0020"); }
        case HTTPC_ERROR_ENCODING:
             if(certificateDownloadInProgress){ return F("CERT-RCA-0021");}else{ return F("OTA-RCA-0021"); }
        case HTTPC_ERROR_STREAM_WRITE:
             if(certificateDownloadInProgress){ return F("CERT-RCA-0022");}else{ return F("OTA-RCA-0022"); }
        case HTTPC_ERROR_READ_TIMEOUT:
            if(certificateDownloadInProgress){ return F("CERT-RCA-0023");}else{ return F("OTA-RCA-0023"); }
        case HTTP_CODE_BAD_REQUEST:
            if(certificateDownloadInProgress){ return F("CERT-RCA-0024");}else{ return F("OTA-RCA-0024"); }
        case HTTP_CODE_FORBIDDEN:
            if(certificateDownloadInProgress){ return F("CERT-RCA-0025");}else{ return F("OTA-RCA-0025"); }
        case HTTP_CODE_NOT_FOUND:
            if(certificateDownloadInProgress){ return F("CERT-RCA-0026");}else{ return F("OTA-RCA-0026"); }
        case HTTP_CODE_METHOD_NOT_ALLOWED:
            if(certificateDownloadInProgress){ return F("CERT-RCA-0027");}else{ return F("OTA-RCA-0027"); }
        case HTTP_CODE_NOT_ACCEPTABLE:
            if(certificateDownloadInProgress){ return F("CERT-RCA-0028");}else{ return F("OTA-RCA-0028"); }
        case HTTP_CODE_PROXY_AUTHENTICATION_REQUIRED:
            if(certificateDownloadInProgress){ return F("CERT-RCA-0029");}else{ return F("OTA-RCA-0029"); }
        case HTTP_CODE_REQUEST_TIMEOUT:
            if(certificateDownloadInProgress){ return F("CERT-RCA-0030");}else{ return F("OTA-RCA-0030"); }
        case HTTP_CODE_INTERNAL_SERVER_ERROR:
            if(certificateDownloadInProgress){ return F("CERT-RCA-0031");}else{ return F("OTA-RCA-0031"); }
        case HTTP_CODE_NOT_IMPLEMENTED:
            if(certificateDownloadInProgress){ return F("CERT-RCA-0032");}else{ return F("OTA-RCA-0032"); }
        case HTTP_CODE_BAD_GATEWAY:
            if(certificateDownloadInProgress){ return F("CERT-RCA-0033");}else{ return F("OTA-RCA-0033"); }
        case HTTP_CODE_SERVICE_UNAVAILABLE:
            if(certificateDownloadInProgress){ return F("CERT-RCA-0034");}else{ return F("OTA-RCA-0034"); }
        case HTTP_CODE_GATEWAY_TIMEOUT:
            if(certificateDownloadInProgress){ return F("CERT-RCA-0035");}else{ return F("OTA-RCA-0035"); }
        case HTTP_CODE_HTTP_VERSION_NOT_SUPPORTED:
            if(certificateDownloadInProgress){ return F("CERT-RCA-0036");}else{ return F("OTA-RCA-0036"); }
        case HTTP_CODE_VARIANT_ALSO_NEGOTIATES:
            if(certificateDownloadInProgress){ return F("CERT-RCA-0037");}else{ return F("OTA-RCA-0037"); }
        case HTTP_CODE_INSUFFICIENT_STORAGE:
            if(certificateDownloadInProgress){ return F("CERT-RCA-0038");}else{ return F("OTA-RCA-0038"); }
        case HTTP_CODE_LOOP_DETECTED:
            if(certificateDownloadInProgress){ return F("CERT-RCA-0039");}else{ return F("OTA-RCA-0039"); }
        case HTTP_CODE_NOT_EXTENDED:
            if(certificateDownloadInProgress){ return F("CERT-RCA-0040");}else{ return F("OTA-RCA-0040"); }
        case HTTP_CODE_NETWORK_AUTHENTICATION_REQUIRED:
            if(certificateDownloadInProgress){ return F("CERT-RCA-0041");}else{ return F("OTA-RCA-0041"); }
        case OTA_INVALID_MAIN_FW_SIZE:
            return F("OTA-RCA-0042");
        case OTA_INVALID_WIFI_FW_SIZE:
            return F("OTA-RCA-0043");
        case CERT_DOWNLOAD_COMPLETE:
        case CERT_UPGRADE_COMPLETE:
            return F("CERT-RCA-0000");
        case CERT_DOWNLOAD_FAILED:
            return F("CERT-RCA-0001");
        case CERT_DOWNLOAD_KEY_FAILED:
            return F("CERT-RCA-0002");
        case CERT_DOWNLOAD_CRT_FAILED:
            return F("CERT-RCA-0003");
        case CERT_DOWNLOAD_ROOTCA_FAILED:
            return F("CERT-RCA-0004");
        case CERT_INVALID_CRT_CHECKSUM:
            return F("CERT-RCA-0005");
        case CERT_INVALID_KEY_CHECKSUM:
            return F("CERT-RCA-0006");
        case CERT_INVALID_ROOTCA_CHECKSUM:
            return F("CERT-RCA-0007");
        case CERT_FILES_NOT_PRESENT:
            return F("CERT-RCA-0008");
        case CERT_INVALID_CONFIG_JSON:
            return F("CERT-RCA-0009");
        case CERT_FILESYSTEM_READ_WRITE_FAILED:
            return F("CERT-RCA-0010");
        case CERT_UPGRADE_START:
            return F("CERT-RCA-0011");
        case MQTT_CONNECTION_ATTEMPT_FAILED: 
            return F("CERT-RCA-0012");  
        case CERT_UPGRADE_FAILED:
            return F("CERT-RCA-0013");
        case CERT_NEW_CERT_NOT_AVAILBLE:
            return F("CERT-RCA-0044"); 
        case CERT_SAME_UPGRADE_CONFIG_RECEIVED:
            return F("CERT-RCA-0045"); 
        case CERT_STATIC_URL_FILE_NOT_PRESENT:
            return F("CERT-RCA-0046");
        case HTTP_CODE_UNAUTHORIZED:
            return F("CERT-RCA-0047");
        case CERT_INVALID_CERT_TYPE:
            return F("CERT-RCA-0048");
        default:
            if(certificateDownloadInProgress){ return F("CERT-RCA-2222");}else{ return F("OTA-RCA-1111"); }
    }
}

void Conductor::mqttSecureConnect(){
   
