mahendrakumarshinde/MyRepo/1. IDE_PLUS Firmwares/wifi_station_ESP32/Conductor.cpp
    //static uint8_t newDownloadConnectonAttempt;
    uint32_t now = millis();
    if(!mqttHelper.client.connected() && (now - m_disconnectionMqttTimerStart > 3000 ) && WiFi.isConnected() || upgradeReceived == true){
          if( certificateDownloadInProgress == false && certDownloadInitAck == false && downloadInitTimer == true && Ping.ping("www.google.com" , 1)){
             if (!mqttHelper.hasConnectionInformations())
             {  
                setMQTTConfig();
                return;
             }else
             {
                 //try connecting with available credentials
                 if (iuWiFiFlash.isFilePresent(IUESPFlash::CFG_MQTT_CLIENT0) && iuWiFiFlash.isFilePresent(IUESPFlash::CFG_MQTT_KEY0) ||
                     iuWiFiFlash.isFilePresent(IUESPFlash::CFG_MQTT_CLIENT1) && iuWiFiFlash.isFilePresent(IUESPFlash::CFG_MQTT_KEY1) )
                 {
                   //Serial.println("ESP32 DEBUG : APPYING THE CERTIFICATES*********");
                   hostSerial.sendMSPCommand(MSPCommand::ESP_DEBUG_TO_STM_HOST,"ESP32 DEBUG : Applying MQTT-TLS Certificates");
                   int certSize,keySize;
                   if( upgradeReceived  && (activeCertificates == 1 && initialFileDownload == false) || activeCertificates == 1 ){
                        //Serial.println("Using Client 1 Certificates");
                        hostSerial.sendMSPCommand(MSPCommand::ESP_DEBUG_TO_STM_HOST,"ESP32 DEBUG : Applying Client1 Certificates");
                        certSize = iuWiFiFlash.getFileSize(IUESPFlash::CFG_MQTT_CLIENT1);
                        keySize  = iuWiFiFlash.getFileSize(IUESPFlash::CFG_MQTT_KEY1);
                        iuWiFiFlash.readFile(IUESPFlash::CFG_MQTT_CLIENT1,mqtt_client_cert,certSize);
                        delay(1);
                        iuWiFiFlash.readFile(IUESPFlash::CFG_MQTT_KEY1,mqtt_client_key,keySize);
                   }else{
                        //Serial.println("Using Client 0 Certificates");
                        hostSerial.sendMSPCommand(MSPCommand::ESP_DEBUG_TO_STM_HOST,"ESP32 DEBUG : Applying Client0 Certificates");
                        certSize = iuWiFiFlash.getFileSize(IUESPFlash::CFG_MQTT_CLIENT0);
                        keySize  = iuWiFiFlash.getFileSize(IUESPFlash::CFG_MQTT_KEY0);
                        iuWiFiFlash.readFile(IUESPFlash::CFG_MQTT_CLIENT0,mqtt_client_cert,certSize);
                        delay(1);
                        iuWiFiFlash.readFile(IUESPFlash::CFG_MQTT_KEY0,mqtt_client_key,keySize);
                   }
                   
                    if ((certificateDownloadStatus == 1 && ( mqttHelper.mqttConnected == 0 && !mqttHelper.client.connected())) || upgradeReceived == true )
                    {
                        // first connection attempt,upgrade Init
                        hostSerial.sendMSPCommand(MSPCommand::ESP_DEBUG_TO_STM_HOST,"ESP32 DEBUG : Certificate Upgrade Init");
                    }
                    // Retry 3 time connection then download new certificates
                    mqttHelper.reconnect();  
                    char reconnectMessage[45];
                    sprintf(reconnectMessage,"ESP32 DEBUG : MQTT Reconnect Attemp :%d",mqttHelper.mqttConnected);
                    hostSerial.sendMSPCommand(MSPCommand::ESP_DEBUG_TO_STM_HOST,reconnectMessage);
                    upgradeSuccess();
                    upgradeFailed();
                    //Retry attempt overflow
                    if (mqttHelper.mqttConnected >= maxMqttClientConnectionCount )
                    {   
                        newDownloadConnectonAttempt++;
                        mqttHelper.mqttConnected = 0;
                        // re-initiate the certifiates download process
                        if (newDownloadConnectonAttempt > maxMqttCertificateDownloadCount)
                        {
                            // TODO : All Retry failed , might be http link broken cannot download certs
                            // Send status to http diagnostic endpoint and show Visuals
                            //Serial.println("\nESP32 DEBUG : ALL MQTT Connection Attemps FAILED ************");
                            hostSerial.sendMSPCommand(MSPCommand::ALL_MQTT_CONNECT_ATTEMPT_FAILED,String(getRca(MQTT_CONNECTION_ATTEMPT_FAILED)).c_str());
                            downloadInitLastTimeSync = millis();
                            upgradeReceived = false;
                            downloadInitTimer  = false;
                            //newDownloadConnectonAttempt = 0;
                            
                        }else {
                            //Serial.println("\nESP32 DEBUG : Download Init trigger.......");
                            upgradeReceived = false;
                            downloadInitTimer = false;
                            espResetCount = iuWiFiFlash.updateValue(ESP_RESET_ADDRESS,espResetAttempt);
                            hostSerial.sendMSPCommand(MSPCommand::CERT_DOWNLOAD_INIT,CERT_DOWNLOAD_DEFAULT_MESSAGEID);
                        }    
                    }
                    
                 }else
                 {
                     // TODO : .crt and .key files not Present
                     // Show Visuals
                     //Serial.println("\nESP32 DEBUG : Files not available to Initiate Certificates Download");
                     hostSerial.sendMSPCommand(MSPCommand::ESP32_FLASH_FILE_READ_FAILED);
                     delay(10);
                     upgradeReceived = false;
                     downloadInitTimer = false;
                     initialFileDownload = true;
                     activeCertificates = iuWiFiFlash.updateValue(CERT_ADDRESS,1);   // Update for first attempt only
                     espResetCount = iuWiFiFlash.updateValue(ESP_RESET_ADDRESS,espResetAttempt);
                     hostSerial.sendMSPCommand(MSPCommand::CERT_DOWNLOAD_INIT,CERT_DOWNLOAD_DEFAULT_MESSAGEID);
                }
                 
                 
