mahendrakumarshinde/MyRepo/1. IDE_PLUS Firmwares/wifi_station_ESP32/Conductor.cpp
             }
          }else
          { 
              // Certificate Download In-progress or all certificates download and connection attempt failed
            //  if (newDownloadConnectonAttempt >= maxMqttCertificateDownloadCount)
            //  {  Serial.println("\nESP32 DEBUG : CERT DOWNLOAD ALL Attempt failed, re-downloading the certificates");
            //      hostSerial.sendMSPCommand(MSPCommand::ALL_MQTT_CONNECT_ATTEMPT_FAILED,String(getRca(MQTT_CONNECTION_ATTEMPT_FAILED)).c_str());
            //  }
             
          }
           
        }
        
        
}

void Conductor::upgradeSuccess(){
    if ((certificateDownloadStatus == 1 && ( mqttHelper.mqttConnected <= 5 && mqttHelper.client.connected())) /*&& upgradeReceived ==true*/)
    {
        // Rollback downloadCertificates
        if(/*upgradeReceived &&*/ activeCertificates == 1){
            //Serial.println("Client 1 Upgrade Success....");
            // backup the older  certificates and use the latest.
            // raname the files or overwrite it. make sure after devicereset it should use new certs
            activeCertificates = iuWiFiFlash.updateValue(CERT_ADDRESS,1);  // client1 in Use after Reset
            hostSerial.sendMSPCommand(MSPCommand::ESP_DEBUG_TO_STM_HOST,"ESP32 DEBUG : Upgrade Success,Updated Flag with Value : 1");
        }else {
            //Serial.println("\nClient 0 Upgrade Success.....");
            activeCertificates = iuWiFiFlash.updateValue(CERT_ADDRESS,0); // Clinet 0 in use 
            hostSerial.sendMSPCommand(MSPCommand::ESP_DEBUG_TO_STM_HOST,"ESP32 DEBUG : Upgrade Success,Updated Flag with Value : 0");
        }
        // Send Upgrade Status 
        hostSerial.sendMSPCommand(MSPCommand::CERT_UPGRADE_SUCCESS,String(getRca(CERT_UPGRADE_COMPLETE)).c_str());
        upgradeReceived = false;
        certificateDownloadStatus = 0;
        iuWiFiFlash.updateValue(CERT_DOWNLOAD_STATUS,certificateDownloadStatus);
    }
}

void Conductor::upgradeFailed(){
    if ((certificateDownloadStatus == 1 && ( mqttHelper.mqttConnected >= 5 && !mqttHelper.client.connected())) && upgradeReceived == true)
    {
        // Rollback downloadCertificates
        if(activeCertificates == 1){
            //Serial.println("Client 1 Upgrade Failed Use previous Client 0 Certificates....");
            // backup the older  certificates and use the latest.
            activeCertificates = iuWiFiFlash.updateValue(CERT_ADDRESS,0);  // client1 in Use after Reset
            hostSerial.sendMSPCommand(MSPCommand::ESP_DEBUG_TO_STM_HOST,"ESP32 DEBUG : Upgrade Failed,Updated Flag with Value : 0");
        }else {
            //Serial.println("\nClient 0 Upgrade Failed Use previous Client1 Certificates.....");
            activeCertificates = iuWiFiFlash.updateValue(CERT_ADDRESS,1); // Clinet 0 in use 
            hostSerial.sendMSPCommand(MSPCommand::ESP_DEBUG_TO_STM_HOST,"ESP32 DEBUG : Upgrade Failed,Updated Flag with Value : 1");
        }
        // Send Upgrade Status 
        hostSerial.sendMSPCommand(MSPCommand::CERT_UPGRADE_ABORT,String(getRca(CERT_UPGRADE_FAILED)).c_str());
        upgradeReceived = false;
        certificateDownloadStatus = 0;
        iuWiFiFlash.updateValue(CERT_DOWNLOAD_STATUS,certificateDownloadStatus);
    }
}
// Certificate managment selection
//String filepath = "/eap_client.crt"; // bin file name with a slash in front.
/**
 * @brief 
 * 
 * @param fs 
 * @param FileSize 
 * @param path 
 * @return true 
 * @return false 
 */
bool Conductor:: writeCertificatesToFlash(IUESPFlash::storedConfig configType,long fileSize,const char* type)
{
    uint8_t buf[512];
    int totalblock = fileSize/512;
    size_t count = 0;
    int loopCnt = 0;
    size_t ReadBlock = 512;
    long len = fileSize;
    unsigned long time1 = 0;
    unsigned long time2 = 0;   

    char filePath[iuWiFiFlash.MAX_FULL_CONFIG_FPATH_LEN];
    iuWiFiFlash.getConfigFilename(configType,filePath,iuWiFiFlash.MAX_FULL_CONFIG_FPATH_LEN);

    if(fileSize%512 != 0)
      totalblock =  totalblock + 1;

    File file = iuWiFiFlash.openFile(configType,"w");
    if(!file){
        hostSerial.sendMSPCommand(MSPCommand::CERT_DOWNLOAD_ABORT,String(getRca(CERT_FILESYSTEM_READ_WRITE_FAILED)).c_str());
        downloadAborted = true;
        upgradeReceived = false;
        return false;
    }
    WiFiClient * stream = http_ota.getStreamPtr();
    while(1)
    {
      delay(5);
      count = stream->readBytes(buf,std::min((size_t)len,ReadBlock));
      if(count != 0) 
      {
        loopCnt++;
        file.write(buf, count);
        if(count < 512) {
          if(loopCnt == totalblock)
          {            
            break; // on last packet          
          }
          else
          {
            //sprintf(TestStr,"SPIFFS RD_Fail1:%s",filePath);
            //hostSerial.sendMSPCommand(MSPCommand::ESP_DEBUG_TO_STM_HOST,TestStr,32);
            return false;
          }          
        }
        if(len < 512)
          ReadBlock = len;
        else
          len = len - count;
      }
      else
      {
         // TODO : Empty File Size, No Stream available, update the Status message 
        file.close();
        hostSerial.sendMSPCommand(MSPCommand::CERT_DOWNLOAD_ABORT,String(getRca(HTTPC_ERROR_NO_STREAM)).c_str());
        downloadAborted =true;
        upgradeReceived = false;
        return false;
      }
      //file.close();
    }

    file.close();
    return true;
}

/**
 * @brief 
 * 
 * @param fs 
 * @param fwpath 
 */
void Conductor:: readCertificatesFromFlash(IUESPFlash::storedConfig configType,const char* type)
{
    char TestStr[64];
    static uint8_t buf[512];
    int totalblock = 0;
    size_t count = 0;
    size_t ReadBlock = 512;
    int loopCnt = 0;
    long len = 0;
    File file = iuWiFiFlash.openFile(configType,"r");

    char filePath[iuWiFiFlash.MAX_FULL_CONFIG_FPATH_LEN];
    iuWiFiFlash.getConfigFilename(configType,filePath,iuWiFiFlash.MAX_FULL_CONFIG_FPATH_LEN);

    if(!file){
        // sprintf(TestStr,"SPIFFS RD_Fail:%s",filePath);
        // hostSerial.sendMSPCommand(MSPCommand::ESP_DEBUG_TO_STM_HOST,TestStr,32);
        hostSerial.sendMSPCommand(MSPCommand::CERT_UPGRADE_ABORT,String(getRca(CERT_FILESYSTEM_READ_WRITE_FAILED)).c_str());
        return ;
    }

    if(file && !file.isDirectory()){
        len = file.size();
        totalblock = len/512;
        if(len % 512 != 0)
          totalblock = totalblock + 1;
        size_t flen = len;
        while(len){
            size_t toRead = len;
            if(toRead > 512){
                toRead = 512;
            }
            loopCnt++;
            file.read(buf, toRead);
            if(/*!(strcmp(filePath,"/iuConfig/certs/client0.crt")) && */!strcmp(type,"MQTT-TLS-CERT"))
            {
                strncpy(&mqtt_client_cert[(loopCnt-1)*512],(const char *)buf,count);    // Update the buffer
                //hostSerial.sendLongMSPCommand(MSPCommand::ESP_DEBUG_TO_STM_HOST,3000000,mqtt_client_cert,sizeof(mqtt_client_cert));
            }
            else if(!strcmp(type,"MQTT-TLS-KEY"))
            {
                strncpy(&mqtt_client_key[(loopCnt-1)*512],(const char *)buf,count);
                //hostSerial.sendLongMSPCommand(MSPCommand::ESP_DEBUG_TO_STM_HOST,3000000,mqtt_client_key,sizeof(mqtt_client_key));
            }else if(!strcmp(type,"SSL"))
            {
                strncpy(&ssl_rootca_cert[(loopCnt-1)*512],(const char *)buf,count);    // Update the buffer
                //hostSerial.sendLongMSPCommand(MSPCommand::ESP_DEBUG_TO_STM_HOST,3000000,ssl_rootca_cert,sizeof(ssl_rootca_cert));
            }else if(!strcmp(type,"OEM-SSL"))
            {
                strncpy(&ssl_oem_rootca_cert[(loopCnt-1)*512],(const char *)buf,count);    // Update the buffer
                //hostSerial.sendLongMSPCommand(MSPCommand::ESP_DEBUG_TO_STM_HOST,3000000,ssl_rootca_cert,sizeof(ssl_rootca_cert));
            }
            len -= toRead;
        }
        file.close();
    } else {
            // TODO : Not define ????
            file.close();
    }
    file.close();
}

/**
 * @brief 
 * 
 * @param tls_uri 
 * @param fileType 
 * @return true 
 * @return false 
 */
bool Conductor::getDeviceCertificates(IUESPFlash::storedConfig configType, const char* type,const char* url)
{
    if(WiFi.status() == WL_CONNECTED) 
    {
        http_ota.end(); //  in case of error... need to close handle as it defined global
        http_ota.setTimeout(otaHttpTimeout);
        http_ota.setConnectTimeout(otaHttpTimeout);
        totlen = 0;
        contentLen = 0;
        otaStsDataSent = false;
        uint8_t http_init_retry = 0;
        while(http_init_retry < MAX_HTTP_INIT_RETRY) 
        {
            if(http_ota.begin(url)) 
            {
                http_init_retry = MAX_HTTP_INIT_RETRY;
                int httpCode = http_ota.GET();
                // httpCode will be negative on error
                if(httpCode > 0)
                {
                    // file found at server
                    if(httpCode == HTTP_CODE_OK)
                    {
                        contentLen = http_ota.getSize();
                        if(contentLen == 0 || contentLen > MAX_MAIN_FW_SIZE)
                        {
                            // TODO : Invalid File size , file is empty or greater than available memory
                            // TODO : Not applicable for certificates 
                            http_ota.end();
                            return false;                           
                        }
                        //fwdnldLen = contentLen;
                        //Write the content to files
                        //Serial.print("Content Len : ");Serial.println(contentLen);
                        writeCertificatesToFlash(configType,contentLen,type);
                    }
                    else
                    {
                        // sprintf(TestStr,"HTTP FAIL:%d",httpCode);
                        //Serial.println("ESP32 DEBUG : httpCode != 200 OK");
                        hostSerial.sendMSPCommand(MSPCommand::CERT_DOWNLOAD_ABORT,String(getRca(httpCode)).c_str());
                        downloadAborted = true;
                        upgradeReceived = false;
                        http_ota.end();
                        return false;
                    }
                } 
                else
                {   
                    // TODO : Handle http error code
                    //Serial.println("ESP32 DEBUG : httpCode < 0 1 --->");Serial.println(httpCode);
                    hostSerial.sendMSPCommand(MSPCommand::CERT_DOWNLOAD_ABORT,String(getRca(httpCode)).c_str());         
                    http_ota.end();
                    downloadAborted =true;
                    upgradeReceived = false;
                    return false;
                }
            }
            else
            {               
                http_init_retry++;
                waitingForPktAck = false;
                http_ota.end();
                delay(2000);
                //Serial.println("ESP32 DEBUG : HTTP URL BEGIN Failed");
                if(http_init_retry == MAX_HTTP_INIT_RETRY)
                { 
                    delay(1);
                    return false;
                }      
            }
        } //  while(http_init == false && http_init_retry < MAX_HTTP_INIT_RETRY)
    }
    else
    {
        // FW Download was initiated... but failed due to WiFi disconnect
        //Serial.println("getDeviceCertificates : Wifi Disconnected");
        hostSerial.sendMSPCommand(MSPCommand::CERT_DOWNLOAD_ABORT,String(getRca(OTA_WIFI_DISCONNECT)).c_str());
        http_ota.end();
        downloadAborted = true;
        upgradeReceived = false;
        return false;       
    }
}

/**
 * @brief 
 * 
 * @return int 
 * */  
int Conductor::download_tls_ssl_certificates(){
      // Read the JOSN from the file and start Download
            // Start Certificate Download Mode /OTA
            // Apply the new Certificates and try connecting
            // Update Success , Failed status codes over Diagnostic endpoint
            // Validate the checksum of the files

            // Assume the URL are available in File
            //if(otaInProgress == true) {
                if (iuWiFiFlash.isFilePresent(IUESPFlash::CFG_CERT_UPGRADE_CONFIG))
                {   
                    DynamicJsonBuffer jsonBuffer;
                    JsonObject& root = jsonBuffer.parseObject(certDownloadResponse);
                    JsonVariant config = root;
                    int configTypeCount = config["certificates"].size();
                    int OEMconfigTypeCount = config["oem-certificates"].size();
                    bool success = config.success();
                    //Serial.print("Arry Size : ");Serial.println(configTypeCount);
                    // Serial.print("CONFIG JSON :");
                    // config.prettyPrintTo(Serial);
                    uint8_t certToUpdate;
                    
                    if(activeCertificates != 0){ 
                        // if(initialFileDownload){
                        //     Serial.println("Initial File Download , Updated Value ");
                        //     activeCertificates = iuWiFiFlash.updateValue(CERT_ADDRESS,0);
                        //     //initialFileDownload = false;
                        // }
                        certToUpdate = 0;
                    }else{
                        certToUpdate = 1;
                    }
                    if (success)
                    {   
                        //Serial.println("Valid JSON Present");
                        for (size_t index = 0; index < configTypeCount; index++)
                        {
                            // Download the certificates and store in to files
                            const char* type = config["certificates"][index]["type"];
                            const char* url = config["certificates"][index]["url"];
                            const char* hash = config["certificates"][index]["hash"];
                            //Serial.print("TYPE : "); Serial.println(type);
                            //Serial.print("URL : ");Serial.println(url);
                            bool downloadSuccess = false;
                            char* checksum ;
                            // Note : upgradeReceived flage is set only for dev testing , can ne removed later (only in this statments not in nested if)
                            int res = downloadCertificates(type,url,hash,certToUpdate);
                            //Serial.print("Output : ");Serial.println(res);
                            if(res != 1){  return 0 ; /*break;*/}   //exit from for loop
                            
                        }   // for loop
                        if(root.containsKey("oem-certificates") && accelRawDataHelper.httpsOEMConfigPresent){
                            for (size_t index = 0; index < OEMconfigTypeCount; index++)
                            {
                                // Download the certificates and store in to files
                                const char *type = config["oem-certificates"][index]["type"];
                                const char *url = config["oem-certificates"][index]["url"];
                                const char *hash = config["oem-certificates"][index]["hash"];
                                //Serial.print("TYPE : "); Serial.println(type);
                                //Serial.print("URL : ");Serial.println(url);
                                bool downloadSuccess = false;
                                char *checksum;
                                // Note : upgradeReceived flage is set only for dev testing , can ne removed later (only in this statments not in nested if)
                                int res = downloadCertificates(type, url, hash, certToUpdate);
                                //Serial.print("Output : ");Serial.println(res);
                                if (res != 1)
                                {
                                    return 0; /*break;*/
                                }             //exit from for loop
                            }
                        }else{
                            if(certToUpdate == 0){
                                iuWiFiFlash.removeFile(IUESPFlash::CFG_HTTPS_OEM_ROOTCA0);
                            }else{
                                iuWiFiFlash.removeFile(IUESPFlash::CFG_HTTPS_OEM_ROOTCA1);
                            }
                        }
                        
