mahendrakumarshinde/MyRepo/1. IDE_PLUS Firmwares/wifi_station_ESP32/Conductor.cpp
                    }else
                    {
                        // TODO : send the status message
                        //Serial.println("Invalid JSON message configuration");
                        //hostSerial.sendMSPCommand(MSPCommand::CERT_DOWNLOAD_ABORT,"Invalid JOSN configuration");
                        hostSerial.sendMSPCommand(MSPCommand::CERT_DOWNLOAD_ABORT, String(getRca(CERT_INVALID_CONFIG_JSON)).c_str());
                        downloadAborted = true;
                        upgradeReceived = false;
                        return 0;
                    }
                       
                }else
                {   
                    // TODO : Handle the Error Code here
                    hostSerial.sendMSPCommand(MSPCommand::GET_CERT_COMMOM_URL,".cert and .Key files not Present show Visuals");
                    //Serial.println(" getCert.conf file not Present");
                    delay(1);    
                    //hostSerial.sendMSPCommand(MSPCommand::CERT_DOWNLOAD_ABORT,".cert and .key not Present, ABORTED");
                    hostSerial.sendMSPCommand(MSPCommand::CERT_DOWNLOAD_ABORT, String(getRca(CERT_CONFIG_JSON_FILE_NOT_PRESENT)).c_str());
                    downloadAborted = true;
                    upgradeReceived = false;
                    return 0;    
                }
        return 1;
                
}

/**
 * calculate the checksum of the file
 */
char* Conductor::getConfigChecksum(IUESPFlash::storedConfig configType)
{
    size_t filesize = iuWiFiFlash.getFileSize(configType);
    size_t configMaxLen = filesize;
    // char config[configMaxLen];
    // strcpy(config, "");
    memset(cert_config,'\0',MAX_SSL_CERT_SIZE);
    size_t charCount = 0;
    if (iuWiFiFlash.available()) {
        charCount = iuWiFiFlash.readFile(configType, cert_config, configMaxLen);
    }
    // Charcount = 0 if flash is unavailable or file not found => Checksum of
    // empty string will be sent, and that will trigger a config refresh
    unsigned char* md5hash = MD5::make_hash(cert_config, charCount);
    char *md5str = MD5::make_digest(md5hash, 16);
    //free memory
    free(md5hash);
    free(md5str);
    return md5str;
}


void Conductor::resetDownloadInitTimer(uint16_t downloadTriggerTime,uint16_t loopTimeout){       
    static int tickCounter;
    downloadTriggerTime = (downloadTriggerTime*1000)/loopTimeout;           // 10*1000/5000     
    
    if (( downloadInitTimer == false && (newDownloadConnectonAttempt > maxMqttCertificateDownloadCount ) ) /*|| !mqttHelper.client.connected()*/    )
          
    {
        // increment the timer tick
        tickCounter += 1;           // increment by every  5sec 
    
        if (tickCounter >= downloadTriggerTime)
        {
            //downloadInitTimer = true;            
            newDownloadConnectonAttempt = 0;
            tickCounter = 0;
            if (debugMode)
            {
                debugPrint("ESP32 DEBUG : Timer Overflow, Re-Initiating Certificate Downloading.");
            }
            //Serial.println("ESP32 : Certificate Download Timer Overflow.....");
            resetMqttConnectionFlags();     // Re-Initiate the Certificate Download process
        }
        
    }
    
}

void Conductor::updateDiagnosticEndpoint(char* diagnosticEndpoint,int length){
    // Update the file with the latest Diagnostic http/https endpoint
    bool success = iuWiFiFlash.writeFile(IUESPFlash::CFG_DIAGNOSTIC_ENDPOINT,diagnosticEndpoint,length);
    if (success)
    {
        if (debugMode)
        {
           debugPrint("Diagnostic URL :");
           debugPrint(diagnosticEndpoint);
        }
        // Update the URL variable
        StaticJsonBuffer<512> JsonBuffer;
        JsonVariant config = JsonVariant(iuWiFiFlash.loadConfigJson(IUESPFlash::CFG_DIAGNOSTIC_ENDPOINT,JsonBuffer));
        bool validConfig = config.success();
        //config.prettyPrintTo(Serial);
        if (validConfig)
        {
            const char* host = config["diagnosticUrl"]["host"].as<char*>();
            int port = config["diagnosticUrl"]["port"].as<int>();
            const char* path = config["diagnosticUrl"]["path"].as<char*>();

            //Serial.print("Diagnostic URL :");
            
            strncpy(diagnosticEndpointHost, host, MAX_HOST_LENGTH); 
            strncpy(diagnosticEndpointRoute, path, MAX_ROUTE_LENGTH);
            diagnosticEndpointPort = port;


        }else
        {
            //Serial.print("Invalid JOSN Format received for Diagnostic endpoint");
            strncpy(diagnosticEndpointHost, DIAGNOSTIC_DEFAULT_ENDPOINT_HOST, MAX_HOST_LENGTH); 
            strncpy(diagnosticEndpointRoute, DIAGNOSTIC_DEFAULT_ENDPOINT_PATH, MAX_ROUTE_LENGTH);
            diagnosticEndpointPort = DIAGNOSTIC_DEFAULT_ENDPOINT_PORT;
            if(debugMode){
                debugPrint("Using Default Diagnostic endpoint");
            }
        }
        
    }else
    {
       strncpy(diagnosticEndpointHost, DIAGNOSTIC_DEFAULT_ENDPOINT_HOST, MAX_HOST_LENGTH); 
       strncpy(diagnosticEndpointRoute, DIAGNOSTIC_DEFAULT_ENDPOINT_PATH, MAX_ROUTE_LENGTH);
       diagnosticEndpointPort = DIAGNOSTIC_DEFAULT_ENDPOINT_PORT;
       if (debugMode)
        {
            debugPrint("Invalid or Failed to write the configuration message");
            debugPrint("Applied Default Diagnostic Configs");
        }
        
    }
    
}

void Conductor::updateConfig(IUESPFlash::storedConfig configType, char* config,int length){
    bool success = iuWiFiFlash.writeFile(configType,config,length);
    if (success)
    {
        if (debugMode)
        {
           debugPrint("Config Json :");
           debugPrint(config);
        }
    }
}

void Conductor::setMQTTConfig(){
    if(iuWiFiFlash.isFilePresent(IUESPFlash::CFG_MQTT)){
        StaticJsonBuffer<512> JsonBuffer;
        JsonObject& config = iuWiFiFlash.loadConfigJson(IUESPFlash::CFG_MQTT,JsonBuffer);
        bool validConfig = config.success();
        //config.prettyPrintTo(Serial);
        if (validConfig)
        {
            strcpy(m_mqttServerIP, config["mqtt"]["mqttServerIP"]);
            m_mqttServerPort = config["mqtt"]["port"];
            strcpy(m_mqttUsername, config["mqtt"]["username"]);
            strcpy(m_mqttPassword, config["mqtt"]["password"]);

            mqttHelper.setServer(m_mqttServerIP, m_mqttServerPort);
            mqttHelper.setCredentials(m_mqttUsername, m_mqttPassword);
        }
    }else{
        strcpy(m_mqttServerIP, MQTT_DEFAULT_SERVER_IP);
        m_mqttServerPort = MQTT_DEFAULT_SERVER_PORT;
        strcpy(m_mqttUsername, MQTT_DEFAULT_USERNAME);
        strcpy(m_mqttPassword, MQTT_DEFAULT_PASSWORD);
        mqttHelper.setServer(m_mqttServerIP, m_mqttServerPort);
        mqttHelper.setCredentials(m_mqttUsername, m_mqttPassword);
    }
}

