mahendrakumarshinde/MyRepo/1. IDE_PLUS Firmwares/wifi_station_ESP32/Conductor.cpp
void Conductor::setHTTPConfig(){
    if(iuWiFiFlash.isFilePresent(IUESPFlash::CFG_HTTP)){
        StaticJsonBuffer<1024> JsonBuffer;
        JsonObject& config = iuWiFiFlash.loadConfigJson(IUESPFlash::CFG_HTTP,JsonBuffer);
        bool validConfig = config.success();
        //config.prettyPrintTo(Serial);
        if (validConfig)
        {
            strcpy(accelRawDataHelper.m_endpointHost, config["httpConfig"]["host"]);
            accelRawDataHelper.m_endpointPort = config["httpConfig"]["port"];
            strcpy(accelRawDataHelper.m_endpointRoute, config["httpConfig"]["path"]);

            if(config.containsKey("httpOem")){
                accelRawDataHelper.setOEMEndpointStaus(true);
                strcpy(accelRawDataHelper.m_endpointHost_oem, config["httpOem"]["host"]);
                accelRawDataHelper.m_endpointPort_oem = config["httpOem"]["port"];
                strcpy(accelRawDataHelper.m_endpointRoute_oem, config["httpOem"]["path"]);
            }else{
                accelRawDataHelper.setOEMEndpointStaus(false);
            }

        }
    }else{
        accelRawDataHelper.setOEMEndpointStaus(false);
        strcpy(accelRawDataHelper.m_endpointHost, DATA_DEFAULT_ENDPOINT_HOST);
        accelRawDataHelper.m_endpointPort = DATA_DEFAULT_ENDPOINT_PORT;
        strcpy(accelRawDataHelper.m_endpointRoute, RAW_DATA_DEFAULT_ENDPOINT_ROUTE);
    }
}

void Conductor::setWiFiConfig(){
    StaticJsonBuffer<512> JsonBuffer;
    JsonObject& config = iuWiFiFlash.loadConfigJson(IUESPFlash::CFG_WIFI,JsonBuffer);
    bool validConfig = config.success();
    //config.prettyPrintTo(Serial);
    if (validConfig)
    {
        const char* tempAuthType = config["auth_type"];
        const char* tempSSID = config["ssid"];
        const char* tempPassword = config["password"];
        const char* tempPasswordOld = config["psk"];
        const char* tempUsername = config["username"];
        const char* tempStaticIP = config["static"];
        const char* tempGatewayIP = config["gateway"];
        const char* tempSubnetIP = config["subnet"];
        const char* tempdns1 = config["dns1"];
        const char* tempdns2 = config["dns2"];
        forgetWiFiCredentials();
        forgetWiFiStaticConfig();
        if(config.containsKey("auth_type")){strcpy(m_wifiAuthType, tempAuthType); }
        if(config.containsKey("ssid")){strcpy(m_userSSID, tempSSID); }
        if(config.containsKey("password")){strcpy(m_userPassword, tempPassword); }
        if(config.containsKey("psk")){strcpy(m_userPassword,tempPasswordOld); strcpy(m_wifiAuthType, "WPA-PSK");}
        if(config.containsKey("username")){strcpy(m_username, tempUsername);}
        if(config.containsKey("static")){m_staticIp.fromString(tempStaticIP); }
        if(config.containsKey("gateway")){m_gateway.fromString(tempGatewayIP); }
        if(config.containsKey("subnet")){m_subnetMask.fromString(tempSubnetIP); }
        if(config.containsKey("dns1")){m_dns1.fromString(tempdns1); }
        if(config.containsKey("dns2")){m_dns2.fromString(tempdns2); }
    }
    connectToWiFi();   
}
void Conductor::sendWiFiConfig(){
    
    hostSerial.mspSendMacAddress(MSPCommand::RECEIVE_WIFI_MAC,m_wifiMAC);
    hostSerial.sendMSPCommand(MSPCommand::RECEIVE_WIFI_FV,FIRMWARE_VERSION);
    if(debugMode){
        debugPrint("Sendig the WiFi MAC and Firmware Version to STM32");
    }
}     
void Conductor::configureDiagnosticEndpointFromFlash(IUESPFlash::storedConfig configType){
        // Update the URL variable
        StaticJsonBuffer<512> JsonBuffer;
        JsonVariant config = JsonVariant(iuWiFiFlash.loadConfigJson(configType,JsonBuffer));
        bool validConfig = config.success();
        // config.prettyPrintTo(Serial);
        if (validConfig)
        {
            const char* host = config["diagnosticUrl"]["host"].as<char*>();
            int port = config["diagnosticUrl"]["port"].as<int>();
            const char* path = config["diagnosticUrl"]["path"].as<char*>();

            //Serial.print("Diagnostic URL Configured from Flash :");
            
            strncpy(diagnosticEndpointHost, host, MAX_HOST_LENGTH); 
            strncpy(diagnosticEndpointRoute, path, MAX_ROUTE_LENGTH);
            diagnosticEndpointPort = port;
            if(debugMode){
                debugPrint("Diagnostic Configs apply successfully from file");
            } 

        }else
        {
            //Serial.print("Invalid JOSN Format received for Diagnostic endpoint, use default");
            strncpy(diagnosticEndpointHost, DIAGNOSTIC_DEFAULT_ENDPOINT_HOST, MAX_HOST_LENGTH); 
            strncpy(diagnosticEndpointRoute, DIAGNOSTIC_DEFAULT_ENDPOINT_PATH, MAX_ROUTE_LENGTH);
            diagnosticEndpointPort = DIAGNOSTIC_DEFAULT_ENDPOINT_PORT;
            if(debugMode){
                debugPrint("Using Default Diagnostic endpoint");
            }
        }
        
}
    


void Conductor::publishedDiagnosticMessage(char* buffer,int bufferLength){

    char message[bufferLength];
    snprintf(message,bufferLength,"%s",buffer);
    if(mqttHelper.client.connected()){
         mqttHelper.publish(CERT_STATUS_TOPIC,buffer);
     }else
     { 
        String auth = setBasicHTTPAutherization();
        uint8_t startIndex = 0;
        if(diagnosticEndpointHost[0] == 'h' && diagnosticEndpointHost[1] == 't' && diagnosticEndpointHost[2] == 't' && diagnosticEndpointHost[3] == 'p'){
            startIndex = 7;
            if(diagnosticEndpointHost[4] == 's'){    // https 
                startIndex = 8;
            }
        }
        //Serial.print("HOST :");Serial.println(&diagnosticEndpointHost[startIndex]);
        int status =  httpPostBigRequest(&diagnosticEndpointHost[startIndex],diagnosticEndpointRoute,diagnosticEndpointPort,(uint8_t*) message,
                                            bufferLength,auth, NULL,HttpContentType::textPlain );

        //Serial.print("Diagnostic POST Status : ");
        //Serial.println(status);
     }
}
/**
 * @brief Published the RSSI 
 * 
 * @param publishedTimeout - Sec
 */
void Conductor::publishRSSI(){
        hostSerial.sendMSPCommand(MSPCommand::GET_ESP_RSSI,String(WiFi.RSSI()).c_str() );
        // Serial.print("Published RSSI");
        // Serial.println(WiFi.RSSI());
}

/**
 * @brief This method takes device mac id as a username without colon and password wiil be reverse of macId
 * 
 * @param macId - bleMacID
 * @return const char* - return the base64 encoded string
 */
String Conductor::setBasicHTTPAutherization(){

    char username[20]; 
    snprintf(username,20,"%s",getBleMAC().toString().c_str());
    removeCharacterFromString(username,':');
    // reverse the string as password
    uint8_t length =strlen(username); 
    char password[length];
    char psw[length];
    strcpy(password,username);
    reverseString(password);
    String auth = base64::encode(String(username) + ":" + String(password));
    
    return auth;
}

void Conductor :: removeCharacterFromString(char* inputString, int charToRemove){
    size_t j,count = strlen(inputString);
    for (size_t i =j= 0; i < count; i++)
        if (inputString[i] != charToRemove)
            inputString[j++] = inputString[i];
        
