mahendrakumarshinde/MyRepo/1. IDE_PLUS Firmwares/wifi_station_ESP32/Conductor.cpp
    inputString[j] = '\0';
    
}
void Conductor :: reverseString(char* username){
    int count = strlen(username);
    int n=count-1;
    for(int i=0;i<(count/2);i++){
       //Using temp to store the char value at index i so 
        //you can swap it in later for char value at index n
        char temp = username[i];    
        username[i] = username[n];
        username[n] = temp;
        n = n-1;

    }
    if (debugMode)
    {
        debugPrint("PASSWORD  : ",false);
        debugPrint(username);
    }
}


void Conductor:: messageValidation(char* json){

     //StaticJsonBuffer<2048> jsonBuffer;
     DynamicJsonBuffer JsonBuffer;
     JsonObject& config = JsonBuffer.parseObject(json);
     JsonVariant configJson = JsonVariant(config);
    //Serial.println("Message Validation : ");
    //configJson.prettyPrintTo(Serial);
     bool validJson = configJson.success();
     uint8_t configTypeCount = configJson["certificates"].size();
     uint8_t OEMconfigTypeCount = configJson["oem-certificates"].size();
     const char* messageID = configJson["messageId"];
     // Note : below 4 files are mandatory except EAP
    if(validJson && WiFi.isConnected() && Ping.ping("www.google.com" , 1)){       // JOSN for Checksum Validation
        //Validate the Response message
        if (iuWiFiFlash.isFilePresent(IUESPFlash::CFG_CERT_UPGRADE_CONFIG) && 
             iuWiFiFlash.isFilePresent(IUESPFlash::CFG_MQTT_CLIENT0) && 
             iuWiFiFlash.isFilePresent(IUESPFlash::CFG_MQTT_KEY0)   &&
             iuWiFiFlash.isFilePresent(IUESPFlash::CFG_HTTPS_ROOTCA0)  || 
             iuWiFiFlash.isFilePresent(IUESPFlash::CFG_EAP_CLIENT0) || 
             iuWiFiFlash.isFilePresent(IUESPFlash::CFG_EAP_KEY0) || 
             iuWiFiFlash.isFilePresent(IUESPFlash::CFG_HTTPS_OEM_ROOTCA0))
        {   
            // Update Certificates Download messageID
            hostSerial.sendMSPCommand(MSPCommand::SET_CERT_DOWNLOAD_MSGID,messageID);
            uint8_t result[CERT_COUNT]; // 10 , max use 5
            uint8_t oem_result[OEM_CERT_COUNT]; // 10 , max use 5

            for (size_t i = 0; i < configTypeCount; i++)
            {
                result[i] =  strcmp(getConfigChecksum(getStoredConfigType(configJson["certificates"][i]["type"], activeCertificates)), (const char* ) configJson["certificates"][i]["hash"] );
            }

            if(config.containsKey("oem-certificates") && accelRawDataHelper.httpsOEMConfigPresent){
                for (size_t i = 0; i < OEMconfigTypeCount; i++)
                {
                    oem_result[i] =  strcmp(getConfigChecksum(getStoredConfigType(configJson["oem-certificates"][i]["type"], activeCertificates)), (const char* ) configJson["oem-certificates"][i]["hash"] );
                }
                if(oem_result[0] == 0){
                    newOEMRootCACertificateAvailable = false;
                }else{
                    newOEMRootCACertificateAvailable = true;
                }
            }
            
            
            if (result[0] == 0 && result[1] == 0 && result[2] == 0 && result[3] == 0 && result[4] == 0)
            {   //0,1 - eap cert and key
                //2, 3,4 - mqtt cert,key,ssl ca  
                // same file available no need to write to file and no need to initiate the downloading
                // TODO : Send the status message Similar certificates already available
                // abort downloading
                /* code */
                //Serial.println("Similar Checksum of all the files, Do not initiate downloading.....");
                newEapCertificateAvailable = false;
                newEapPrivateKeyAvailable = false;
                newMqttcertificateAvailable = false;  // false
                newMqttPrivateKeyAvailable = false;
                newRootCACertificateAvailable = false;
                // Abort Download
                //Serial.println("\nABORTED Download and Sending Status message....");
                //Send the Status message
                //TODO : Temp Change 
                // if(upgradeReceived){
                //        //Serial.println("Ingnoreing the Checksum comparision during dev testing..."); 
                //     hostSerial.sendMSPCommand(MSPCommand::ESP_DEBUG_TO_STM_HOST,"ESP32 DEBUG : Ignoring Checksum Comparision for dev. testing");
                //        //TODO : Check availabel cert and new certs checksum 
                // }else{ 
                    if((accelRawDataHelper.httpsOEMConfigPresent && oem_result[0] == 0) || (!accelRawDataHelper.httpsOEMConfigPresent)){
                        newOEMRootCACertificateAvailable = false;
                        hostSerial.sendMSPCommand(MSPCommand::CERT_DOWNLOAD_ABORT, String(getRca(CERT_SAME_UPGRADE_CONFIG_RECEIVED)).c_str());
                        downloadAborted =true;  
                    }
                  
                //}
                //resetMqttConnectionFlags();
            }
            if (result[0] != 0 || result[1] != 0)
            {
                // New EAP Certificate available
                newEapCertificateAvailable = true;
                newEapPrivateKeyAvailable = true;
             }
            if (result[2] != 0 || result[3] != 0)
            {
                // New MQTTS Certificate available for downloading
                newMqttcertificateAvailable = true;
                newMqttPrivateKeyAvailable = true;
            }
            if(result[4] != 0){
                // new SSL rootCA.crt is available for downloading
                newRootCACertificateAvailable = true;
            }
            
        }
        else
        {
            // First time downloading the certificates , when files are not available, ignore the checksum comparision here
            bool configWritten = iuWiFiFlash.writeFile(IUESPFlash::CFG_CERT_UPGRADE_CONFIG,json, sizeof(json) );
            if(!configWritten){
                    // Failed to write to Flash File system 
                    // TODO : Publish status to diagnostic endpoint
                    hostSerial.sendMSPCommand(MSPCommand::ESP32_FLASH_FILE_WRITE_FAILED);
                    //Serial.println("ESP32 DEBUG : ESP32_FLASH_FILE_WRITE_FAILED");
                    delay(1);
                    hostSerial.sendMSPCommand(MSPCommand::CERT_DOWNLOAD_ABORT);
                    downloadAborted = true;
            }else
            {       if(configTypeCount > 3){
                        // EaP Certificates available for download
                        newEapCertificateAvailable = true;
                        newEapPrivateKeyAvailable = true;
                    }    
                    newMqttcertificateAvailable = true;  
                    newMqttPrivateKeyAvailable  = true;
                    newRootCACertificateAvailable = true;
                    if(accelRawDataHelper.httpsOEMConfigPresent){
                        newOEMRootCACertificateAvailable = true;
                    }
                    //Serial.println("succefully  written the config JOSN to File First time.");
            }
        }
    }else
    {
        //Serial.println("Received Invalid JSON in msg Validation");
        hostSerial.sendMSPCommand(MSPCommand::CERT_DOWNLOAD_ABORT, String(getRca(CERT_INVALID_CONFIG_JSON)).c_str());
        downloadAborted = true;
    }
    
