mahendrakumarshinde/MyRepo/1. IDE_PLUS Firmwares/wifi_station_ESP32/Conductor.cpp
}

bool Conductor::validateCertType(const char* type){
    for(int i = 0;i<sizeof(CERT_TYPES);i++){
        if(strcmp(type,CERT_TYPES[i]) == 0 ){
            return true;
        }
    }
    return false;
}

IUESPFlash::storedConfig Conductor::getStoredConfigType(const char* certType,bool partation){
    if(partation == 0){
        if(strcmp(certType,"EAP-TLS-CERT") == 0){
            return IUESPFlash::CFG_EAP_CLIENT0;
        }else if(strcmp(certType,"EAP-TLS-KEY") == 0){
            return IUESPFlash::CFG_EAP_KEY0;
        }else if(strcmp(certType,"MQTT-TLS-CERT") == 0){
            return IUESPFlash::CFG_MQTT_CLIENT0;
        }else if(strcmp(certType,"MQTT-TLS-KEY") == 0){
            return IUESPFlash::CFG_MQTT_KEY0;
        }else if(strcmp(certType,"SSL") == 0){
            return IUESPFlash::CFG_HTTPS_ROOTCA0;
        }else if(strcmp(certType,"OEM-SSL") == 0){
            return IUESPFlash::CFG_HTTPS_OEM_ROOTCA0;
        }
    }else{
        if(strcmp(certType,"EAP-TLS-CERT") == 0){
            return IUESPFlash::CFG_EAP_CLIENT1;
        }else if(strcmp(certType,"EAP-TLS-KEY") == 0){
            return IUESPFlash::CFG_EAP_KEY1;
        }else if(strcmp(certType,"MQTT-TLS-CERT") == 0){
            return IUESPFlash::CFG_MQTT_CLIENT1;
        }else if(strcmp(certType,"MQTT-TLS-KEY") == 0){
            return IUESPFlash::CFG_MQTT_KEY1;
        }else if(strcmp(certType,"SSL") == 0){
            return IUESPFlash::CFG_HTTPS_ROOTCA1;
        }else if(strcmp(certType,"OEM-SSL") == 0){
            return IUESPFlash::CFG_HTTPS_OEM_ROOTCA1;
        }
    }
}
int Conductor::downloadCertificates(const char* type,const char* url,const char* hash,uint8_t certToUpdate){

    bool downloadSuccess = false;
    char* checksum ;
    //Serial.print("CERT TYPE : ");Serial.println(CERT_TYPES[index]);
    // Individual file download is disabled now , rebuilt it                    
    if (validateCertType(type) || upgradeReceived == true) 
    {
        downloadSuccess = getDeviceCertificates(getStoredConfigType(type,certToUpdate),type,url); // Upgrade client 1
        if (downloadSuccess)
        {
            // File Download and stored success
            // Read the certificates and print
            checksum = getConfigChecksum(getStoredConfigType(type,certToUpdate));    //verify client 1
    
            if (strcmp(hash,checksum) == 0)
            {
                // TODO : .CERT DOWNLOAD Success
                //Serial.println("VALIDATION Success");
                //hostSerial.sendMSPCommand(MSPCommand::CERT_DOWNLOAD_SUCCESS,".rootCA VALIDATED");
            }else
            {
                // TODO : Invalid Checksum abort Upgrade
                 //Serial.print("INVALID CHECKSUM ");
                // Serial.println(checksum);
                hostSerial.sendMSPCommand(MSPCommand::CERT_DOWNLOAD_ABORT, String(getRca(CERT_INVALID_CRT_CHECKSUM)).c_str());
                downloadAborted = true;
                upgradeReceived = false;
                return 0;
            }
           
        }else
        {   
            // TODO :
            //Serial.println("File Download Failed");
            hostSerial.sendMSPCommand(MSPCommand::CERT_DOWNLOAD_ABORT, String(getRca(CERT_DOWNLOAD_FAILED)).c_str());
            downloadAborted = true;
            upgradeReceived = false;
            return 0;
        }
    }else{
            hostSerial.sendMSPCommand(MSPCommand::CERT_DOWNLOAD_ABORT, String(getRca(CERT_INVALID_CERT_TYPE)).c_str());
            downloadAborted = true;
            upgradeReceived = false;
            return 0;
    }
    return 1;
}


bool Conductor:: setCertificateManagerHttpEndpoint(){

    bool configAvailable = iuWiFiFlash.isFilePresent(IUESPFlash::CFG_STATIC_CERT_ENDPOINT);
    if (configAvailable)
    {   
        if(debugMode){
            debugPrint("HTTP Common Endpoint present.");
        }
        //Serial.println("Common endpoint file is present");
        return true;
    }else
    {   // Construct the JSON 
        // {"certUrl":{"url":"http://13.235.210.250:8000/certificates?deviceIdentifier=94:54:93:4A:27:ED"},"messageId":"cEgxwaPKJRCRloSNYW0xk3GFp"}
        //Serial.println("Constructing STATIC URL JSON ");
        // StaticJsonBuffer<256> JsonBuffer;
        // JsonObject& root = JsonBuffer.createObject(); 
        // root["cert"]["url"] = CERT_CONFIG_DEFAULT_ENDPOINT_HOST + String(":") + CERT_CONFIG_DEFAULT_ENDPOINT_PORT + CERT_CONFIG_DEFAULT_ENDPOINT_PATH 
        //                         +  "94:54:93:4A:27:ED" ;
        // root["messageId"] = "123456789";
        // root.prettyPrintTo(Serial);
       // Serial.print("MAC ID :");Serial.println(getBleMAC().toString().c_str());
        //if(uint64_t(m_bleMAC) > 0) {
            // String commonEndpoint = String(CERT_CONFIG_DEFAULT_ENDPOINT_HOST) + String(":") + 
            //                         String(CERT_CONFIG_DEFAULT_ENDPOINT_PORT) +
            //                         String(CERT_CONFIG_DEFAULT_ENDPOINT_PATH); //+
            //                         //getBleMAC().toString().c_str();
            
            String  messageId = "123456789";
            hostSerial.sendMSPCommand(MSPCommand::SET_CERT_DOWNLOAD_MSGID,messageId.c_str());
            char config[256];
            snprintf(config, 256, "{\"certUrl\":{\"host\":\"%s\",\"port\":%d,\"path\":\"%s\"}, \"messageId\":\"%s\"}",CERT_CONFIG_DEFAULT_ENDPOINT_HOST,
            CERT_CONFIG_DEFAULT_ENDPOINT_PORT,CERT_CONFIG_DEFAULT_ENDPOINT_PATH,messageId );
            //Serial.print("Certificate Manager JSON : ");
            //Serial.println(config);

            bool writeSuccess = iuWiFiFlash.writeFile(IUESPFlash::CFG_STATIC_CERT_ENDPOINT,config,sizeof(config));
            if(writeSuccess){
                if(debugMode){
                    debugPrint("Default certificate Manager Endpoint Write Success.");
                }
                //Serial.println("Default Certificate Manager API write Success");
                return true;
            }else
            {   
                if (debugMode)
                {
                    debugPrint("Default Certificate Manager Endpoint Failed to write in to File.");
                }
            
                return false;
            }
                
        }
    return false;
        
    
}

void Conductor::resetMqttConnectionFlags(){

    downloadInitTimer = true;
    certificateDownloadInProgress = false;
    certDownloadInitAck = false;
             
}